{
  "id": "adapting",
  "title": "Adapting to the Unforeseen",
  "summary": "<div id=\"book\"><p> <a id=\"glitches\">How to deal with technical glitches?<\/a> <\/p> <p> You might recall that story I shared during Marin’s earlier chapter on presentation preparation. The one regarding the inconvenience of standing on a desk in front of everyone, desperately trying to start up a defunct equipment. Surprisingly, situations like this one are more common than expected. They might actually be the rule rather than the exception. It goes without saying it is in your best interest to keep those to a minimum. <\/p> <p> It is best to minimize the chance of them happening AT ALL than trying to figure out methods to ameliorate the effects. Damage control are the two words that you don’t want to hear too often. Here is my advice, tried and tested (yes, I had my share of embarrassments): <\/p> <p> <a id=\"equipment\">Know your equipment<\/a> <\/p> <p> The software (everything from the OS to the plugins used in the very presentation tools that you use) and the hardware (your laptop, the beamer and everything in between). Common associated mistakes are: <\/p> <ul> <li>Loading times are not included<\/li> <li>Automatic updates<\/li> <li>Desktop notifications<\/li> <li>Various sound alerts<\/li> <li>Confidential or even worse, embarrassing material visible (especially on the desktop)<\/li> <li>Laptop battery dies, charger not attached, or even worse - forgotten at the office<\/li> <li>Software incompatibility; the automatic conversion from .pptx to .ppt does some crazy stuff with an outcome that is rarely desired.<\/li> <\/ul> <p> <a id=\"prep\">Preparation, preparation, preparation:<\/a> <\/p> <ul> <li>Keep a backup in the cloud<\/li> <li>Don’t transfer files on a USB at the last moment. Even better - don’t use an USB at all<\/li> <li>Check the internet connection beforehand if you are going to need it; if it is a wi-fi connection make sure the strength is good enough for your purpose. Make sure to log-in if it is a secure connection<\/li> <li>If you are going to need other applications make sure to load them, together with the necessary files, beforehand in order to save time. Make sure not to overload your machine if it runs low on RAM and processing power. Also make sure to check for any sensitive material anywhere in these applications as well, especially web browsers<\/li> <li>Beamers need to warm-up, at least 3 min. Take this into account. If you have sound in your presentation, make sure there are speakers around beforehand. Imagining an audience of 300 listening to laptop speakers makes me uncomfortable.<\/li> <\/ul> <p> <a id=\"malfunction\">If something malfunctions anyways<\/a> <\/p> <p> Well, we know very well. There is always a chance for a glitch. If this happens, don’t complain. Act confidently to repair what is wrong. Best is to ask members of the audience (this is also great to have friends and colleagues there, or even better, to have a support staff close at hand). Deflect it with humor. If it takes too long, don’t be afraid to take the responsibility to cancel the presentation. This is much better than actually forcing people to walk out by keeping them waiting for too long. <\/p> <\/div>"
}