{
  "id": "additional-notes-on-slide-design",
  "title": "Additional Notes On Slide Design",
  "summary": "<p> Try to avoid adding unnecessary animations in your slides. Because the presentation tools we have at our disposal provide a long list of possible transition and animation effects, most people are often tempted to experiment with weird and ridiculous animations. I am sure you have witnessed quite a few yourself. It is a great distraction to look at moving text and pictures appearing with a 360 degree pirouettes. It hurts the eyes and you don't want to cause your audience to suffer a vertigo. Also, if you choose to add a transition effect to your slides make sure it is a very simple one and you stick with it throughout the presentation. Don't forget - consistency, consistency, consistency. It will save you a lot of trouble! <\/p> <p> And a note on using word art: PLEASE DON'T! Word art sucks and it doesn't bring any real value to your presentation. Use the space you have on your slides wisely, don't get tempted into filling it with ugly drawings. Choose a photo instead. <\/p> <p> Talking about pictures - we mentioned in the previous section that you have several options to choose pictures from. You can buy stock photos or search on Google for appropriate ones. However, the best way is to make your own pictures. All you need is a camera and, if needed, an editing software. A combination of these can produce great results for your presentation. You will have unique images that illustrate your point exactly as you intended them to do. You will not compromise. It might take a bit more time to do that, but the benefits outweigh the effort you need to invest. And you will be comfortable that you are not using someone else's work and you won't get any problems with copyrights. In case you don't have access to image editing software you needn't worry. Most presentation applications have in-built image editing functions that are more than enough to create stunning visuals without much effort. <\/p>"
}