{
  "id": "body-language",
  "title": "Body Language",
  "summary":"<p> Did you know that body language accounts to as high as 80% percent of interpersonal communication? And that most of the time you are not aware of it? Your body language can easily give away how you feel. If you know how to use it, it can be a powerful tool to show your enthusiasm. Your body language includes your posture, movement around the room, facial expression, where you keep your hands, what you do with your hands - pretty much every gesture that you make can be added to the category of body language. I will focus on the most relevant ones that can influence your lecture. <\/p> <ul> <li>Posture<\/li> <li>Moving around the room<\/li> <li>Facial expression<\/li> <li>Hands<\/li> <li>Voice<\/li> <li>Microphones<\/li> <li>Eye contact<\/li> <li>Be assertive, yet respectful<\/li> <li>Believe in what you are saying<\/li> <\/ul> <p> <a id=\"posture\">Posture<\/a> <\/p> <p> The way you stand can show a lot about who you are. If you stand up straight you project confidence, power and energy. Assume the posture of a bent old man and you will project a weak and tired image. For your purpose you need to have a posture that transmits energy and enthusiasm. It must also show your confidence. This will be noticed by your audience on a subconscious level and they will get energized and enthusiastic as well. Try to be aware of your posture and make the necessary improvements if necessary. <\/p> <p> <a id=\"room\">Moving around the room<\/a> <\/p> <p> Be careful about your movement in the room. Don't pace or walk around too much - this is very distracting to your audience and they will have to focus on following your movement instead on what you are saying. Try not to stand still the whole time either - this can also have a distracting effect, because people might start looking elsewhere once they are used to you standing in one place. Try to find a balance and change your position slightly every once in a while. For example, you can change your position according to the screen each time you begin talking on a new section of your presentation. Be careful not to stand in front of the screen though! As much as you have to be the centre of attention, if you stand in front of your slides people will try to read and see what is right behind you. You don't want them moving around and annoyed. <\/p> <p> <a id=\"face\">Facial expression<\/a> <\/p> <p> Your face is a great communicator of how you are feeling in the moment of speaking. Try to avoid looking too sleepy or bored. Always aim to have an expression of relaxation and confidence. Your audience will notice and it will begin to feel the same way. Smile, but don't grin. Open your eyes, but don't stare. To become aware of what your face expresses when you talk, stand in front of a mirror and look at what you are doing. Practice until you get the right positive expression. <\/p> <p> <a id=\"hands\">Hands<\/a> <\/p> <p> We tend to do a lot of involuntary movement with our hands when we are talking and most of it can be a great source of distraction during a lecture. Do not keep your hands in your pockets - it projects a reserved image. Instead you can keep them in front of you with the fingertips of each of your hands touching. Don't move your hands too much when you are talking - your audience will focus on the moving hands and get distracted from the content. Use well thought movements if you want to illustrate something or make a distinction between two things when you are talking. In addition, you should avoid holding any objects, except a wireless presenter, in your hands. If you hold something you might unconsciously begin to play with that object. Some people like to hold pens while presenting and they don't realize that halfway through their talk they start clicking or playing around with it. It is a distraction that can cause your audience to focus on your hands than the content of the lecture. <\/p> <p> <a id=\"voice\">Voice<\/a> <\/p> <p> The tone of voice can have a dramatic effect on your presentation. You need to speak clearly and energetically. Try to be louder, but don't shout. Think of the people sitting at the back of the room - will they be able to hear you? When you speak clearly and louder you project further confidence and enthusiasm. This will keep your audience alert and interested in what you are saying. Avoid sounding monotonous - you will only make the whole room sleepy. <\/p> <p> <a id=\"mic\">Microphones<\/a> <\/p> <p> In case you have to present to a larger audience in a bigger venue you’ll probably have to use a microphone. Already in the preparation stage, when you have been inquiring about the equipment, you should have asked about microphone use. The organisers probably have a very good idea what type of microphones they will provide you with. Check if you’ll be able to use a hands-free microphone like a headset or a lavalier – the best two options for you. <\/p> <p> What is wrong with the good old handheld mic? <\/p> <p> In short, it is distracting for you and the audience. If you use a standard handheld microphone you could experience quite a few inconveniences. For starters, it is quite big. Then you have to be mindful to always hold it in front of you, close to your mouth to make sure your voice gets through without interruptions. By doing this you are adding an unnecessary distraction between you and the audience. The mic and your hand are hiding part of you and your face, making it harder to communicate. Also, you now have only one hand to use, since the other one is occupied with the task of holding the microphone. This makes it harder to explain things and optimise your use of body language. Last, but not least, the way you hold it could make it very amusing for the audience. I have witnessed a lot of keynotes during which the presenters hold the microphone like their favourite rock star, but let’s face it, they probably didn’t get the same reaction as their idols (unless an actual rock star is presenting – then it is all forgiven). <\/p> <p> Why are hands-free options better? <\/p> <p> Well, they are smaller, lighter, hardly noticeable and they cannot preoccupy your or the audience’s attention. A headset also looks pretty cool when it’s on your presenting head. You can even pretend to be a member of a top secret military squad, your favourite ‘80s action hero or a brave customer support specialist – whatever gives you more confidence. The lavalier is an even better option because you can simply attach it to your jacket or shirt and forget about the fact that you are wearing a microphone. With either of these options you cannot go wrong when presenting. You will have your hands free to use during your talk, you won’t have to worry about volume and if everyone in the audience can hear you. <\/p> <p> <a id=\"eyes\">Eye contact<\/a> <\/p> <p> You have to keep eye contact with the audience. This creates a connection and keeps everyone involved. When you look someone in the eye you can tell if the other person is listening or he has his mind wandering somewhere else. This is a great way to evaluate how you are doing during the presentation and change things if needed. Don't focus on just one point in the room - look both to your left and right, as well as in the centre. You have to leave the impression that you are giving your whole attention to everyone. Another big mistake to avoid is to turn your back on the audience and start reading from your slides or prepared notes. This breaks the communication flow immediately and you risk losing the attention of your audience. <\/p> <p> <a id=\"assertive\">Be assertive, yet respectful<\/a> <\/p> <p> If you master your body language you will be able to deliver engaging presentations that resonate with your audience. They, in turn, will become more involved and will follow the presentation more attentively. When you master your body language and put the techniques I outlined here into practice, you will project an assertive, yet respectful image that will improve the overall atmosphere in the room. You will show that you are the true expert in your field and the topic you are discussing is very important and you care about it deeply. One note of caution - be careful not to appear arrogant or you might risk the dislike of your audience who will then choose not to listen to what you are sharing with them. <\/p> <p> <a id=\"believe\">Believe in what you are saying<\/a> <\/p> <p> The best presenters who are able to inspire their audience to change believe strongly in what they are talking about. You also feel more confident about your performance when you truly stand behind what you are saying. Once you have this belief you should aim to transmit this to your audience. You can do that by using adjectives that show your enthusiasm, for instance, \"remarkable\", \"amazing\", \"great\", \"exciting\", you get the idea. These are words with very strong positive connotation that can really help your task as a lecturer. <\/p>"
}