{
  "id": "choosing-the-right-tools",
  "title": "Choosing The Right Tools",
  "summary":"<p>There are plenty of options for you to choose from when it comes to presenting. In this book we have identified four stages that you need to go through if you want to deliver the ultimate presentation experience - preparation, design, delivery, and evaluation. And for each of these you have a big choice of tools you can use. Below we have listed and explained the most helpful tools for each stage.<\/p> <ul> <li>Preparation<\/li> <li>Designing your presentation<\/li> <li>Delivery<\/li> <li>Evaluation<\/li> <\/ul> <p><a id=\"preparation\">Preparation<\/a><\/p> <p>For your preparation stage there is no better tool than a simple Gantt chart. It is a popular project management tool that you can easily make using an Excel spreadsheet, although there are now free tools available on the internet. The Gantt chart is a table that visualizes the tasks you need to complete over the timeframe you have set in advance. Using it is simple and filling it takes less than five minutes. It will provide you with a visual representation of the whole process from start to finish, or in your case from preparation to evaluation.<\/p> <blockquote>For your preparation stage there is no better tool than a simple Gantt chart<\/blockquote> <p><a id=\"designing\">Designing your presentation<\/a><\/p> <p>When you come to the design stage of your lecture you are faced with overabundance of tools that can help you present your information. The list varies from established software like Microsoft's PowerPoint and Apple's Keynote, to a wide range of online presentation tools that provide new creative ways of communicating information. The following is a brief review of five of the most popular presentation software we believe you have to know about - PowerPoint, Keynote, Prezi, SlideRocket, and Google Drive’s presentation software.<\/p> <p>PowerPoint<\/p> \"Microsoft PowerPoint 2010 gives you more ways to create and share dynamic presentations with your audience than ever before. Exciting new audio and visual capabilities help you tell a crisp, cinematic story that’s as easy to create as it is powerful to watch. In addition, PowerPoint 2010 enables you to work simultaneously with other people or post your presentation online and access it from virtually anywhere using the Web or your smartphone.\" (Microsoft.com) <p>PowerPoint is by far the most popular presentation software out there. It's success can be traced back to the success of the MS Office package among Windows PCs and to the wide range of functions the tool has. To get a better overview of all the functions of PowerPoint and what the software delivers head over to this link: http:\/\/office.microsoft.com\/en-us\/powerpoint-help\/what-s-new-in-powerpoint-2010-HA010336563.aspx<\/p> <p>Keynote<\/p> <p>\"Even if you’ve never used Keynote before, you’ll find creating a presentation surprisingly simple. It all starts with an enhanced Theme Chooser that lets you preview an impressive collection of 44 Apple-designed themes. Drag across a theme to skim through its slide designs. Once you’ve chosen the perfect canvas for your presentation, simply substitute your own words and images for the placeholder text and graphics. Thanks to the Slide Navigator, the progress of your presentation and its organization are always in view.\" (Apple.com)<\/p> <p>Apple's Keynote is the presentation tool that is part of its iWork suite. A major competitor to PowerPoint, this tool will give you a wide range of options to design your lecture. One big advantage of this software is that Apple has made it available on its mobile iOS and you will be able to view the presentations you make on an iPhone and iPad. To learn more about the features of the software, check out the following link: http:\/\/www.apple.com\/iwork\/keynote\/<\/p> <p>Prezi.com<\/p> <p>\"Prezi is a cloud-based presentation software that opens up a new world between whiteboards and slides. The zoomable canvas makes it fun to explore ideas and the connections between them. The result: visually captivating presentations that lead your audience down a path of discovery.\" (prezi.com)<\/p> <p>Prezi is one of the most popular web-based presentation tools. It takes a different approach to presentations - the information is not visualized on separate slides - it enables you to put all the information in one place to have an overview and focus on specific parts while you are presenting. Using creative animations and intuitive design, this tool will make your presentations stand out. Bare in mind though that the features of Prezi are limited compared to those of PowerPoint and Keynote. So, you need to be sure of the purpose of your presentation to be sure that it is the best choice for your lecture. To see how Prezi works and check examples of presentations check out this link: http:\/\/prezi.com\/explore\/<\/p> <p>SlideRocket<\/p> <p>\"With a full set of professional design tools SlideRocket helps you create breathtaking presentations that will wow your audience. Combine themes and layouts, shapes, charts, tables, pictures, audio, HD video, and Flash to tell your story without compromise. SlideRocket goes way beyond its desktop counterparts and offers you the power of the Internet. Easily integrate content from free public web resources like Flickr or YouTube and utilize plug-ins from Yahoo! and Twitter to extend functionality and quickly add pre-formatted content to your slides.\" (sliderocket.com)<\/p> <p>SlideRocket is another web-based presentation software that you can use to design your presentation. The biggest differentiator of this tool is its functionality with the internet and other rich multimedia web-based services. This tool facilitates a quick method for inserting rich visuals from all over the web and other popular services. What you need to consider though is that you need an online connection to create your presentations. Viewing them, however, is widespread across multiple mobile platforms and in both on- and offline mode. Learn more about what you can do with SlideRocket here: http:\/\/www.sliderocket.com\/product\/<\/p> <p>Google Drive’s Presentation App<\/p> <p>\"Share and collaborate together.Invite others to view or edit your presentation, work with team members to see changes instantly, and chat with others directly in the presentation. Create a compelling story with more features.Rich animations, customized drawings, seamless transitions, embedding capabilities, a variety of themes, and much more. Access your presentations anywhere. You can share and present at a moment’s notice from wherever you are.\" (google.com)<\/p> <p>The search giant is well-known for its flagship, cloud-based digital services. Part of their Google Drive suite is a presentation app which lets you create your slides online and show them without the need to buy a stand-alone software or other extras. The service is not as complex and filled with functions as the other tools we reviewed up to now. However, it provides an inexpensive solution for you if you need to fix a simple slide presentation. Basic features like themes, adding images, charts and tables are available to the user. To see an example of what the software looks like and learn more about its features go to this page: http:\/\/drive.google.com<\/p> <p>Each of these tools are a good place to start designing your presentations. First, all of these now allow collaboration among several people, so that you can build a presentation together with your colleagues if necessary and avoid exchanging email after email with different versions of the presentation file. All you need for this is an internet connection. Second, all the tools we've mentioned also vary significantly in price. PowerPoint and Keynote are the most expensive ones, but when you buy them you also get them in a bundle with other useful tools and both products provide a lot of functions that other tools don't - complete offline operation is one of them. Furthermore, it is quite likely that if your institution is using a Microsoft (Windows) or an Apple (Mac OS) operating system you already have free access to at least one of these tools! Third, all the web-based tools have a free version which you can use with certain limitations, but that might be sufficient for you. Google Drive is completely free. Fourth, the web-based services provide you the option to upload your slide presentations and convert, show or change them through their own functions.<\/p> <p>If you are going 100% mobile…<\/p> <p>Haiku Deck is another great presentation app that is available on mobile devices and will let you create beautiful, visual and minimalist presentations with just a few taps of your finger. The tool offers only a few basic functions - to add a title and subtitle to a slide, to illustrate the story with a beautiful image and view or share your final product. Haiku Deck’s biggest positive is that by limiting you to just a few pieces of content it triggers your creativity to find the best way to present your information with no clutter and distractions. You and your story are the centre of attention.<\/p> <p> <a id=\"delivery\">Delivery<\/a> <\/p> <p> When it comes to the part where you have to deliver the presentation there are several hardware tools that you need to consider. Your institution might already have a pretty good infrastructure in place, so you might not have to worry too much about hardware and just show up and deliver - the computer, projector, and the interactive boards will already be there. This is OK equipment to work with. However, you are becoming limited by relying only on these tools and as a result of that your performance might suffer. There are a couple of things you can choose to do in order to improve the quality of your presentations and make a great delivery. First, you can start by bringing your own laptop or tablet device that has the presentation on it. Going for this option will give you confidence in the equipment and you shouldn't worry about compatibility issues or outdated software and hardware stalling. The second tool that you need to acquire is a wireless presenter that works with your computer or mobile device. The wireless presenter will give you the freedom of moving around the room or stage and avoid the distracting practice of changing your slides manually with the keyboard or turning your back to the audience to click the interactive screen. To find a wireless presenter head to the nearest hardware or computer store or browse the Amazon.com catalogue for a wide range of price and model options (here is a link showing the search results Amazon produced for \"wireless presenter\" - <a href=\"http:\/\/www.amazon.com\/s\/ref=nb_sb_ss_i_3_28?url=search-alias%3Daps&amp;field-keywords=wireless+presenter\"> http:\/\/www.amazon.com\/s\/ref=nb_sb_ss_i_3_28?url=search-alias%3Daps&amp;field-keywords=wireless+presenter <\/a> ). In case your institution has not equipped the rooms with projectors, and you are required to get one from the IT guys, you might consider investing in your own projector which you can keep in your office when you don't use it. This way you can make sure that you will have a projector at hand without worrying about reservations or wearing out of the image quality from frequent usage. <\/p> <blockquote>A wireless presenter will give you the freedom of moving around the room or stage<\/blockquote> <p> <a id=\"evaluation\">Evaluation<\/a> <\/p> <p> You presentation doesn't end with your \"Thank you!\" slide. If you want to deliver as a true KTG you must constantly evaluate your performance and ask for feedback from your audience. After all, communication is a two-way process! One of the best ways is to ask immediately after the presentations is over. However, a lot of people sometimes find it hard to give critical feedback, or simply don't want to talk in public. That is why it is important to be proactive and provide alternative channels for those people. Their opinion is as valuable as the opinion of the most renowned authority on the topic and you shouldn't ignore their feedback and advice. We are very fortunate to have tools that can facilitate such an exchange. Praise the digital age! <\/p> <p> The internet has revolutionized the way we communicate among each other and in groups. Visionaries of this age provide us with tools like online forums and social networks that can serve as a feedback channel for your audience. Setting up such a channel is as simple and quick as switching on your computer. With just a few clicks and an email address, you can set up discussion forums online, open a Facebook group with your audience as participants, or set up a twitter chat over a specific topic. The possibilities are vast and you can get creative with it. You shouldn't get carried away though and start wasting time while online. That is why you need to specify in advance the time you will allocate for collecting feedback and you should inform your audience about it as well. <\/p> <p> Your planning is ready and you know which tools you will require for your lecture. Next, you should look for additional information related to your topic and collect the material you think is relevant for your audience and can bring extra value to the lecture. <\/p>"
}