{
  "id": "conclusion",
  "title": "Conclusion",
  "summary": "<p> There is something very memorable in the silence of a few hundred people. What can be so important that all of them are quiet and even forget to take a breath? <\/p> <p> A lone voice echoes through the enormous space of the big hall. It has been ages since it was last filled to such an extent, perhaps this is why the occasion feels so memorable. It must seem very strange to the eyes and ears of an observer passing by the university building to witness this enormous aggregation of people sitting, as if paralysed, with eyes fixed on a single spot in front of them, as if hypnotised by some sorcerer of ages past. <\/p> <p> The voice pauses for a second, just enough to give the stone walls of the hall the chance to absorb the sheer deepness that emanates from it. Then the sudden sound of a lone applause startles everyone and in a few milliseconds the walls tremble from the thunder of clapping hands and standing up people. <\/p> <p> He had been talking for the last hour and yet it felt as if it was just a minute ago when he stood up and walked in front of the audience. Some find the inevitable silence of a curious and strict audience just before a lecture starts unnerving, but to him it was a challenge he would gladly accept. For a split second he didn’t even think about the talk and just lived through the moment. The light from the huge windows on the right side of the hall was flowing majestically, illuminating everything in its path. Small dust particles contributed even further to the academic atmosphere. Everyone’s eyes were fixed in his with anticipation. <\/p> <p> He did not remember much of what was to follow, nor did he care particularly much about that. A standing ovation was nothing new to him, but this one was special. This was more than just recognition. <\/p> <p> A flame was ignited in each and every one of the people in the hall. All this from the tiny spark of genius that he was capable of sharing. <\/p>"
}