{
  "id": "conversation-with-the-audience",
  "title": "Conversation With The Audience",
  "summary":"<p>One of the most important things to realise as a presentation great is that the whole process is not one-dimensional. Presentations are an opportunity to have a dialogue with the audience and acknowledge their input. A true KTG would always be listening back, making sure that the members of the audience have the opportunity to join in the conversation. Sometimes these might be in the form of annoying distractions, sometimes they could be a spontaneous remark during the presentation, or a vigorous discussion during a Q&A session.<\/p> <ul> <li>How to deal with interruptions from the audience?<\/li> <li>Interact with your audience<\/li> <li>Icebreakers<\/li> <li>Handling Q&amp;A sessions<\/li> <\/ul> <p> <a id=\"interruptions\">How to deal with interruptions from the audience?<\/a> <\/p> <p> A presenter commanding respect of the audience is ideal. Here are two of the most common types of interruptions: <\/p> <ul> <li>Random<\/li> <\/ul> <p> Cell phone usage should be treated as a crime against humanity. I would advice to also ban laptop usage (of course sometimes it might be necessary, especially for students doing some related task), since it poses an enormous distraction to everyone, especially to the people around and behind the laptop. And that is not even considering the possible malfunctions that can distract the audience. <\/p> <p> Attendees coming late should not be tolerated either. If possible have someone at the door who can ensure that no latecomers will disrupt your work. <\/p> <p> People talking is best solved by stopping and being silent. The collective embarrassment is a good way to train minds. Talking for a long time even if it is done in a discrete way is disrespectful to say the least and should have a zero tolerance policy attached to it. <\/p> <ul> <li>Constructive<\/li> <\/ul> <p> Someone has a question or an idea and cannot wait for the appropriate moment to share it (either at the end of the presentation in the designated slot, or at least after you have finished your thought). Questions interrupt the flow of mind, even if they are good ones. There is only one way to handle this and it is to kindly ask the person to write the question down and ask it afterwards. <\/p> <p> <a id=\"interact\">Interact with your audience<\/a> <\/p> <p> <a id=\"icebreakers\">Icebreakers<\/a> <\/p> <p> There is nothing better than to use your sense of humor as an icebreaker. There must be positive energy radiating from you when you present. Thus people will not only listen to what you’ve got to say, they will get inspired and their own thinking process will get that much needed fuel to burn. Make sure to include humor everywhere, even when you talk about yourself. Nobody likes someone who takes himself too seriously. Relaxed and positive atmosphere of learning is best for presentations. <\/p> <p> In some other cases, though, different “atmospheres” should be created. Some more drama can do wonders at a conference where an exciting and ground-breaking idea is presented. This will amplify the effect with an order of magnitude. This is especially relevant if you want to raise awareness about an issue or you appeal for funding or popularity for a cause. <\/p> <p> <a id=\"qas\">Handling Q&amp;A sessions<\/a> <\/p> <p> This is the time when the effect of your presentation can be either greatly enhanced or gravely reduced. Here both your knowledge and confidence will be put to the test. Especially true for conferences and department meetings. <\/p> <p> Hope for the best, but prepare for the worst. Expect vicious remarks made by jealous people who want to put you down. Even personal remarks are not out of the question. Here the most important points are the following: <\/p> <ul> <li>Keep your appearance cool, even if you boil on the inside. This is not easy, but it is a method that can be learned. Learn to be an actor and improve your posture, body language and voice.<\/li> <li>Be polite. Yes, even to the rudest of questions or remarks. Be polite and everyone will respect and admire you more for that.<\/li> <li>Speak less, say more. Speak slowly, clearly and to the point. Take your time to think. Ask people to rephrase their queries if you need more time. Give them half-answers if you need to.<\/li> <li>Practice rhetorics. Even the learned talk won’t save you from a grilling Q&amp;A session from more knowledgeable and ruthless people than you are. But if you appear confident by following the points above and master the art of talking you will leave the session proudly, having increased your reputation as an expert. Eloquence might just save the day.<\/li> <\/ul>"
}