{
  "id": "create-logical-structure",
  "title": "Create A Logical and Easy-To-Follow Structure",
  "summary": "<p> Your work doesn't end at the design of your slides. You also need to design the structure of your presentation. How are the slides going to appear on the screen? You need to pay special attention to the flow of information and ideas. There needs to be a seamless transition. It must also be possible for your audience to navigate easily through the slides and be aware at each time where you are in the presentation. Consistency, as mentioned earlier, must be present at all times during your presentation. It's extremely important for your structure. <\/p> <ul> <li>Creating a seamless flow of information and ideas<\/li> <li>Making it easy for your audience to follow you<\/li> <\/ul> <p> <a id=\"seamless\">Creating a seamless flow of information and ideas<\/a> <\/p> <p> During your preparation stage you need to make a decision on how you are going to arrange your slides. In what order are your ideas going to appear on the screen for your audience to see? While you are reading and digesting your material, make sure that you clarify for yourself its logical structure. In most cases that is how you will proceed with your presentation as well - you will follow the structure of the material you are presenting. <\/p> <p> Sometimes, you will have extra information that you consider relevant to the topic you are presenting. Make sure that when you include it, it fits perfectly with the main content. If you want to show your audience something outside of your slides, a YouTube video for instance, make sure you preload it before the presentation starts. Do not lose time to click on links and waiting for the video to load. If possible, try to download the video and embed it in your presentation - it will spare you the trouble of opening browser windows and dealing with slow Internet connection. There are quite a lot of plugins and add-ons available for the most popular browsers that can help you do that. Google Chrome and Mozilla have a great database where you can search for these plugins. Just type in something like \"YouTube video downloader\" and you will get plenty of results. Check the rating of the plugin and choose the one with the most votes or positive reviews. Once your video has been downloaded, just use your presentation software's insert function. It's as simple as that! <\/p> <p> How you present the topic is closely related to how you design your slides. To achieve a seamless transition make sure you use only one background and the same colour scheme. Also take note of the arrangement of visual objects and text on your slides. Make sure you have the same structure throughout your deck. <\/p> <p> <a id=\"follow\">Making it easy for your audience to follow you<\/a> <\/p> <p> The audience must be aware at all times where you are during the presentation. Find a solution which works best for you to show where you are at every moment of speaking. You can do that in many ways: you can put the name of the section as a heading, or use different colours assigned to respective sections, or use shapes that corresponds to the different parts. You can get really creative here and design your own system. <\/p> <p> if you choose to go with showing the names of each section, make sure you put them either as a heading, or in the left hand side of the slide. However, having the name of the section as a heading might leave you with too much text per slide and you might end up with unnecessary distractions. Having the sections outlined on the left is a better solution. It leaves you enough space in the rest of the slide to add your content. But again, if you choose this technique you must cleverly design the outline, otherwise it will end up as a distraction. <\/p> <p> There is a more effective way to help your audience follow you. Choose a combination of shapes and different colours. Once you know how many sections you will include in your presentation select a corresponding number of simple shapes. Go for a square, a bar or a circle - something not too complicated. Then make sure that all the shapes are the same size. You can do that by simply copy-pasting the first shape. Then you need to assign each shape to a different colour that represents the separate parts in your presentation. Make sure the colours are easy to distinguish. Next, you need to choose a way to highlight each shape in turn that corresponds to the section you are talking about. You can do that by changing the size of the shape, or dimming the colour of the other shapes. You aim to achieve an effect that \"sticks out\" to make it simple and easy for your audience to identify the section. <\/p> <p> You can put this \"navigation\" tool in the top left corner of your slides. Don't make it too big, but make sure it is easy to identify the separate parts in your presentation. Place it in the top left corner, because it is the first place your audience looks at when you change slides. To save more time when you are designing the slides set up this navigation tool in the Slide Master and create the different slide layouts there with the shapes changing colour and form. Then, add the different slide layouts in the main menu and later you can just choose them from the drop-down list of your application. <\/p>"
}