{
  "id": "create-simple-visual-environment",
  "title": "Create A Simple and Effective Visual Environment",
  "summary": "<p> Less is more. Just look around you and you will notice how more and more people today begin to appreciate the genius of simple, elegant and minimalistic design. Unintentionally, you might think about Apple when you first hear minimalistic design. And you are right to do so - the company has some of the most admired and recognizable designs on the planet and has inspired many others to follow in this direction. Companies are making a similar transition to simplicity - car manufacturers, soft drinks companies, producers of kitchen appliances...the list can go on and on. This is all a result to our heightening interest in minimalism. <\/p> <p> Back to presentation design - your audience consists of people whose lives are being changed by these brands and lead by this new trend of simple design. So, a similar approach to a presentation will resonate much more with your audience than the widely spread lazy act of just copy-pasting parts of text and throwing a couple of pictures in between. The winning formula is to strive for clarity and simplicity that further enhances the story you are presenting and assists you in making a point and leaving an impression in your audience’s mind. <\/p> <ul> <li>Choosing the right background<\/li> <li>Colour selection<\/li> <li>Coffee table books<\/li> <li>Consistency<\/li> <li>Using the right visuals<\/li> <li>Using text<\/li> <li>Avoid standard fonts<\/li> <li>What's the ratio between visuals and text that we recommend you use in your presentation?<\/li> <\/ul> <p> <a id=\"background\">Choosing the right background<\/a> <\/p> <p> Before you do anything else in your presentation software you have to decide on a suitable background. The choice of a background can make or break your presentation. Choose some kind of picture and you will end up with a distracting background which makes it hard for your audience to focus on the important content you are presenting. Another faulty practice is to select one of the default backgrounds that come with your software. Your presentation immediately loses any personal touch and it becomes obvious that you didn't put too much effort into it. A selection of bright colours is not a good idea either. Choosing a bright red or a bright blue background will make your content hard to see. Furthermore, because of varying quality of different projector models, such colours do not always appear on the screen as you see them on your laptop or desktop computer. <\/p> <p> Instead, opt for a neutral colour - black or white. Working with one of these will make your life much easier and will give you a lot of opportunities to unleash your creativity. In this case, the background becomes your canvas. Using a single colour eliminates any distractions that might decrease your audience's attention. Moreover, contrast on a black or white background is much easier to achieve. The text or visual objects you add will stick out much better if you make such a choice. In addition to black and white, grey can also serve as a good basis for your presentation. With the selection of such colours as a background you secure a good start on the road to simplicity. No distractions of any kind will enter your mind or that of your audience. <\/p> <p> It is possible to customise your background by adding a logo or a small visual object or shape that represents your institution’s identity. However, it is quite likely that the people who are listening to you already know where you work and don’t need reminding on every slide about your organization. A logo on your first and possibly your last slide is more than enough. Avoid adding unnecessary information like slide numbers or the date on the background. This is not a document and most of your audience will be aware of the date! <\/p> <p> In order to avoid the hassle of adding objects to customize each of your slides, consider using the Slide Master function of the software you use. PowerPoint and Keynote both have the Slide Master option and it would be a crime not to use it. It is a time and worry saver. Customize your slides with the slide master right after you start the application and later, you will only have to add content for every slide you need. <\/p> <p> Also, the Slide Master option allows you to design different type of slides which you might decide to use in your presentation. You can customize each of them to best suit your purpose but be careful to not get carried away - using different types of slides just because you have them available could turn into a distraction for the audience. Stick to two, three types at most. <\/p> <p> Last, but not least, customize the font in the Slide Master, so that text elements will be the same throughout your presentation. It will save you plenty of trouble in the end, especially if others will be working with the presentation file. People do not always pay attention to the way text appears on their slides the person left with the job of finishing the presentation is left tweaking font size, position and alignment until his head starts to hurt. So, make sure to fix that before you exit the Slide Master function and proceed with the content of your presentation. <\/p> <p> <a id=\"colour\">Colour selection<\/a> <\/p> <p> One of the best techniques to select the right colors for your presentation is to simply try. And test which ones go well with the background. Consider also how will they contrast and work with each other. Your audience needs to be able to make a clear distinction between the different elements. Use contrasting colors. Black and white, orange and black, white and red, yellow and black, grey and orange, blue and white, blue and white and grey, orange and purple and grey - there are plenty of great combinations you can experiment with. <\/p> <p> One more technique is to observe the world around you. Look carefully at your surroundings. There are more than enough examples of beautiful color combinations around you. Nature provides over abundance of fantastic colors that go together like magic. Human creations must not be ignored either. You like this new concept car by BMW and you can't stop admiring its design, especially the colors? Well, here's a thought - remember them (or do a google search later) and use them in your presentation. You can find inspiration and ideas everywhere around you. Just look for it. You will be surprised. <\/p> <p> <a id=\"coffee\">Coffee Table Books<\/a> <\/p> <p> I find coffee table books on design, architecture and photography to be especially good sources of inspiration when choosing colours that go well together. The visual presentations in these books are usually of the highest quality and you cannot go wrong in choosing a pattern you saw in one of them and apply it to your presentation. <\/p> <p> <a id=\"consistency\">Consistency<\/a> <\/p> <p> Here is the place to introduce the concept of consistency. You must always aim to maintain consistency throughout your slides. Consistency of colours is especially important. Once you set your mind on the best colours for your presentation, stick with them until the end. Do not change them half way through you slides, because your audience will get confused. Inconsistency will bring a feeling of confusion to your audience, even if only on a subconscious level. It is my personal experience that when colours are changed in the middle of a presentation I get distracted and focus too much on figuring out what has changed. I lose focus and attention...then it is very hard to get back on the same track with the presenter. <\/p> <p> Inconsistency could work for you in one way. In case you want to accentuate on a specific word or a concept, to demonstrate the culmination in your presentation, or just to make a point that will stick in the mind of your audience, you might then seek to change the colours. But be careful when you use this effect. Do this too early and it becomes too much of a distraction. You don't want confused eyes, staring at the screen behind you. You should have the audience's full attention at all times. <\/p> <p> <a id=\"visuals\">Using the right visuals<\/a> <\/p> <p> Photos, videos, tables and charts are the most powerful tools when you want to visualize information. We live in a visual world and lately, with the massive expansion of digital technologies and the Internet, we have been transformed into visual junkies. Stories, told with just one picture are being published online, put on posters at bus stops and printed in your favorite magazines. Raw data needs to be presented in a simple to understand chart or a table to be made accessible and understandable for non-experts. Visualization of information is a serious business and it has a significant impact on the way we make presentations. Beautifully presented data is a treat for the eye, and your audience will appreciate it if you make the effort to cater to their visual needs. Their attention will increase and interest in the topic will reach new heights. <\/p> <p> It is essential to transfer the concept of simplicity to the use of visuals. You don't want to use random pictures on every slide. Try to choose a similar type of picture. Preferably, use your own or find a colleague, a friend, or even a student that could help you with this. Try to establish a logical connection between the different pictures, even if you use them to illustrate two opposing points. In case you don't have access to private photos you can check what Google can offer with its image search function. It is a cost effective and quick method of finding appropriate, high-quality pictures online. The only drawback of using these pictures is that they are owned by other individuals and in case your presentation reaches high popularity, they might cause you a bit of a problem. Especially if the images you used have been copyrighted. If you decide to use images from Google, think about adding a slide at the very end of your presentation stating that the images you used are not yours and refer to the sites on which you found them. Another option you can use to help you find high-resolution pictures is stock photo websites which operate as online retailers of other people's work. Once you find the right picture you have the option to buy it and it becomes your property to use in the presentation. Stock photos are a good solution if you need a very specific picture which you cannot make yourself and you cannot find via image search. Have in mind that this might cost you a bit more, but the investment will pay off in the future. <\/p> <p> With tables and charts you have the freedom to experiment as much as you like with the software you have. PowerPoint already has an integrated tool that links you to Excel and allows you to visualize any type of data. Just add the numbers and categories you want and the program does its own thing. It puts your numbers into a visually appealing chart or a table. You also have plenty of standardized design available to choose from, but to push the level of your presentation higher, you should try making your own design. One very important rule here is to stick to the minimalistic concept - don't try to make overcomplicated and colourful charts and tables. These objects provide plenty of opportunities to change their appearance, but play too much with that and you will end up with a complicated mixture of colours and shapes that is hard to comprehend for even the best of minds. Use basic, contrasting colors instead. Stick to colours that go together well and don't put extra pressure on your audience to try and figure out what you are showing them. <\/p> <p> It will be much easier to design your graphs if you follow the advice in the previous chapter about the preparation of sketching your slides. Sketching will help you visualize the data in your head and you will understand which important relations and results need to be shown. Don't try to put all your data in your slide presentation. Once again - too much is not always desirable. You don't want your audience to get confused about what you showed them and forget the information five minutes later. Show the data that matters most and is the most remarkable. Focus on the results you include and make comparisons carefully, only with data you have included on the slides. Try to be concise in your communication - there is a limit to the capacity of the human brain to comprehend information. Put too much on show and you will have wandering eyes and yawning people sitting in front of you. <\/p> <p> <a id=\"text\">Using text<\/a> <\/p> <p> One might argue that a presentation should include nothing more than just pictures, tables and charts. This is not a bad idea, but quite often you need to explain a complex concept or a rule that is hard to visualize only through images. This is when you need to introduce text on your slides. And this is where it most frequently goes wrong for a lot of people. It seems that we are often tempted to put a whole novel on a single slide and we think that it will look even better if we add some bullet points, perhaps choose a very small font, so we can add even more text. We often get carried away with this and the results are usually appalling. A presenter who puts blocks and blocks of text, one after another faces the danger of boring his audience and losing credibility. It's a very frustrating experience for the audience who will try to read everything they see on the screen as if this is the only time they are going to see the text. And how good are you at both listening and reading at the same time? Can you do both and be 100% mentally present in the room? I highly doubt it. Your attention should not be divided between two activities. And during a presentation all the attention must be on the speaker and what he talks about. <\/p> <p> Adding excerpts of text from the material you used to prepare can be a result of your desire to avoid misunderstanding of the content. But the most common reason that leads to this is laziness. Think about it: you are preoccupied with other tasks on your agenda, or you find the topic not interesting enough, or you simply cannot understand what the text is about. Then you choose the easiest way - copy and paste the text and let the audience deal with it. Unfortunately, the people on the receiving end are not that keen on dealing with \"it.\" They need a simple and concise summary of what you are showing them. They need a main point that will stick in their mind. <\/p> <p> This is the key to managing text in your slides - add only the focus of the topic you are discussing or the main point you want to make about a specific subject. Sometimes, one word is more than enough. A sentence or a quote will do just as well. By doing this you strip your slides of any unnecessary interruptions and distractions. Show your audience the one word, phrase or sentence you chose and explain what is behind it. In your own words! Show them that you know what you are talking about and are an expert on the subject. Consequently, attention, credibility and trust from your audience to you will increase significantly. <\/p> <p> To be able to practice this technique comfortably you need to go through the preparation stage we have outlined in the previous section. If you understand and know the material you are presenting, and you have the necessary expertise on the topic you shouldn't have any problems with summarizing and communicating what you have to say. Do your homework before you begin with the design of your presentation. It will save you time, effort and nerves. <\/p> <p> <a id=\"fonts\">Avoid standard fonts<\/a> <\/p> <p> The use of the standard fonts which come preselected when you open the presentation software must be avoided if you want to achieve presentation greatness. Arial, Calibri, Times New Roman are all fine, but for the purpose of your presentation you should look somewhere else for the right font. There are already plenty of options that come preinstalled with each device and there is an even wider variety of free or inexpensive collections of fonts online which you could download and use. When adding your text you should look through what is available and select the best one for you. <\/p> <p> One of the most important reasons against the use of custom fonts is the fact that it could easily leave an impression of carelessness from your side and a lack of effort invested in your work. If that happens your audience could quickly lose interest and you could lose their attention. Furthermore, the use of such fonts make your slides look like the pages of a word document and we’ve already said that this is not how you design a presentation. In fact, because it starts to resemble a word document you might be subconsciously tempted to add more text than necessary. What is even worse is that you might find yourself in the “copy – paste” trap and add unedited chunks of text to the slides. <\/p> <p> Another good reason to stay away from standard fonts is that they probably won’t fit with your unique design. The colours, shapes, sizes – you spent a lot of time thinking about these and combining them in the most optimal way and it will be a shame to ruin it all by not opting for a font different than the preselected one. You will know when you have the right font when it fits perfectly with the other elements on the slide and there is an overall visual pleasantness. <\/p> <p> Consider the intention of the presentation and the content as well when you are making a choice on fonts. If your overall theme is minimalism go for fonts that are simple, easy to read and without excessive elements to the characters. If you are working on a presentation that is about a unique new product perhaps you should choose a font that captures some of the product’s identity. <\/p> <p> If you have a corporate selection of fonts at your disposal you might want to consider using those instead. Most of the time these were developed by experienced designers who develop fonts that are functional and representative of the organisation’s identity. If you do that, be mindful of the official guidelines that come with the fonts – you want to keep the corporate look and feel as complete as possible, while still tailored to the needs of your unique presentation. <\/p> <p> <a id=\"ratio\">What's the ratio between visuals and text that we recommend you use in your presentation?<\/a> <\/p> <p> 3:1. Try to stick to this ratio - one block of short text (usually your main point or focus) supported by one to three visual objects - either pictures, tables, or charts. Why 3:1? Because we can associate information with visuals much easier than with plain text. Furthermore, this will give you a lot of freedom to liberate the audience from the burden of having to read large chunks of text from your slides. The visuals will be quickly processed in the minds of your audience and they will be able to stay focused on you and what you are telling them. Make sure that the objects you use are self-explanatory and everyone will \"get them right\" the first time. <\/p>"
}