{
  "id": "dealing-with-anxiety",
  "title": "Dealing With Anxiety",
  "summary":"<p>One of the most natural sensations that presenters often have to deal with is anxiety. Some dread it, others have learned to avoid it or at least deal with it. In situations when you are bout to face an audience, especially when the stakes are high, you are most likely to feel under some pressure and encounter anxiety. Below, we are going to look a bit into this phenomenon and offer some advice on how to deal with anxiety on your way to becoming a KTG.<\/p> <ul> <li>Anxiety, where does it come from?<\/li> <li>The illusion of perfect and negative consequences<\/li> <li>Mindfulness – tips and techniques<\/li> <\/ul> <p> <a id=\"anxiety\">Anxiety, where does it come from?<\/a> <\/p> <p> <a id=\"illusion\">The illusion of perfect and negative consequences<\/a> <\/p> <p> Like a lot of people, when I first started to give presentations and speak in front of an audience I often felt insecure, nervous and anxious before it was my turn to get on the stage. I’ve been in situations where the pressure felt so big that I forgot all I have prepared to talk about and had to rely on improvisation (and it didn’t impress anyone because I also sucked at improvising under pressure). Even though I have been preparing like crazy, read articles, blogs and presentation books in hope of dealing with this issue I still expected that something will go wrong, that I will do or say something embarrassing and present not just my work, but myself in a terrible way. These thoughts were building up into way too much pressure and anxiety. Why was this happening? I wanted to clear it up for myself and this intention got me thinking. I was about to make a very insightful journey into my consciousness that would change my presentation ability in a significant way. <\/p> <p> My old self used to believe that in order to achieve success and do whatever he was doing right he had to achieve a 100% of the expected result (and the expectations he used to set were really, really high). Any other outcome was considered as failure. He was living and thinking within the constraints of extreme expectations. This perspective was so dominant in his mind that he had been putting everything around himself, all the elements of his life, including his presentation skills, into this context of extremes. He believed that doing this allowed him to always aim at the highest possible result or outcome and therefore, spend extra effort and perseverance on what he was doing. His motivation was feeding on his expectations. It made no difference if he was striving for personal, academic or professional success – the expectation was always to reach perfection. <\/p> <p> This quest for reaching the perfect outcome had an interesting and unhealthy side effect – the fear of negative consequences. If the old self could not achieve 100% then all the efforts would be in vain and he would be a failure, an embarrassment, his credibility as an expert damaged without the chance of fixing it. There was appreciation for success only, nothing else. This fear of negative consequences fit perfectly with the high expectations that were set from the very beginning. They both worked really well together. One could say it was a match made in heaven. The old self thought he could utilise both to become even better, reach more perfection faster. <\/p> <p> But this was causing a lot of pressure which, in turn, was becoming hard to deal with it. The old self started to feel exhausted. All the effort and mental strain that this desire to reach perfection required caused him to feel tired. And it was not so much a physical tiredness, but tiredness from always having to be on 100%, be the achiever, be perfect. He began to realise that while trying to reach the perfect state he did not have much fun and then when he achieved perfection he could barely enjoy it. His mind was so set on working towards the next level, to push the boundaries further, that reaching perfection was no longer satisfactory. He had to do even better. The good feeling of achieving something lasted for a brief moment, not long enough to savour it, and then it was anxiety again - “what’s next” he was thinking. This disillusionment hit him hard. <\/p> <p> Fortunately, he had some great friends who had radically different perspectives on life and he was smart enough to open up to some of the things they were talking about. That is how he became aware of a new point of view of life that was radically different from his own beliefs. <\/p> <p> He wanted to change things around, overcome this anxiety that was arising from his working style. So, step by step, with the help of knowledge provided by his friends he began to change things around. First, he addressed the fear of negative consequence. He stumbled upon an elegant and simple solution to this issue. He started asking himself a simple question before every situation that was causing him anxiety and made him feel under pressure: “What’s the worst that could happen?” Once he asked himself this question he could realise quickly that everything is fixable, if it goes wrong at all, and there are much more important things in life that he should be appreciating. It was giving him a helicopter view of his life. The mindset that came from it was to appreciate the present, what he already has and rejoice from positive experiences. Perfection was no longer to be achieved in the future from the fruits of his labour. He was living in the present moment... and perfection was already there. <\/p> <p> When the fear of negative consequences disappeared it became relatively easy to gain control over the pressure. Before presentations he was now able to control the negative feelings – he simply asked himself “What’s the worst that could happen?” and the answer was always calming. It also reassured him of his ability as a presenter (and we already know that this confidence can be a powerful ally). <\/p> <p> This change happened a couple of years ago. Before I realised how unsatisfactorily my way of thinking was I found it hard to enjoy my work and it almost led to a burnout. This crazy pursuit of perfection and worries about the negative outcomes were harming my ability as a presenter. So, after experiencing the first benefits of this new point of view towards life and work I became a big fan of it and as a result I think I am a much better presenter now (and closer to becoming a KTG, of course). <\/p> <p> Now, when I begin work on a presentation I am very calm and relaxed about the delivery stage and the outcomes of my work. I know that if I inject a lot of passion and commitment into what I do and show this to my audience they will appreciate it and will not care about my imperfections and a glitch here or there on the presentation. We are all human and no matter how hard we try there will be things that will go wrong and we cannot fix or avoid. Instead of judging negatively and with fear of embarrassment we should appreciate these flaws because they give to the presentation experience our stamp of uniqueness. <\/p> <p> The way we perceive ourselves and our work has a dramatic effect on our ability to enjoy both life and work (which should not necessarily be viewed separately). Realising that perfection is an illusion is also key to getting into this state of mind. To put it more poetically (and with the risk of sounding cheesy) the illusion of perfect is the perfect illusion. Only after recognising this we can savour each moment and reach calmness of mind and confidence in our abilities. It just takes practice and some inward focussing to understand this. Perfection is all around and with that mindset you are a step closer to being a KTG! <\/p> <p> <a id=\"mindfulness\">Mindfulness – tips and techniques<\/a> <\/p> <p>...TO DO...<\/p>"
}