{
  "id": "define-desired-outcome",
  "title": "Define Desired Outcome",
  "summary":"<p> Before you begin the design of your presentation and add the content to it you need to specify for yourself: what do you want to achieve with your lecture? The ultimate goal would be to deliver an inspiring effort that will change something in your audience by introducing something new or challenge an existing world view. You need to carefully craft a message which will resonate with your audience that will serve this purpose. But to do that successfully you first need to understand who the people in your audience are. It makes a big difference how you give a presentation to a group of first-year university students and how you present in front of a group of your most recognized peers or board of directors of the company. Furthermore, you have to clarify for yourself what you want the audience to get out of your presentation. For instance, you might want to shift their understanding of an existing scientific concept, or you might want to get them excited about a topic that is going to be extensively discussed in your newest book. Only then should you start defining your key message of the presentation that will lead to the desired outcome. <\/p> <ul> <li>Who is your audience?<\/li> <li>What do you want them to get out of your presentation?<\/li> <li>Craft your message<\/li> <\/ul> <p> <a id=\"audience\">Who is your audience?<\/a> <\/p> <p> Identifying your audience is a lot like finding your target group if you decide to go into the business of selling a product or a service. There are various characteristics or personal traits which you need to consider before you start work on the presentation. Age, gender, and education level are factors which you shouldn't overlook. Giving a presentation to an international audience is quite different from giving one in front of a group of people sharing your own nationality. The language difference in such a case is a key factor. Chances are that if you are presenting to an international audience it will be in English. You need to consider that not everyone's level of English is the same, or perhaps yours is not as good. Language misunderstandings could lead to miscommunication and harm the relationship between the presenter and the audience. If that happens you will have a hard time achieving your goal. Cultural differences play an important part as well. People are used to different ways of expressing themselves and how they are being perceived. You might decide to keep a very formal style of communication that doesn't appeal to your audience and they never warm up to you or your material. A very informal style on the other hand might be too much to handle for people from high-context and hierarchical cultures. Obstacles like these can have a damaging effect on your lecture and your reputation as well - going back and trying to fix things doesn't always work for everyone.If you want to learn a bit more about cultural differences and how they can have an impact on your work you must find the book Cultures and Organizations: Software of the Mind by the Dutch scientist Geert Hofstede. <\/p> <blockquote>Don't expect that everyone will know or understand what you are talking about<\/blockquote> <p> The level of relevant experience is another dimension which you have to consider. A group of young first year students will lack the deep, clinical understanding of the subject that you or your peers of highly-qualified experts have. Don't expect that everyone will know or understand what you are talking about. Do not leave anything to chance - be prepared to always state the obvious. Spend a few moments during your preparation stage to try and learn as much as possible about your audience. This will pay off immensely during the presentation. You will feel more comfortable, you will enjoy the experience and your audience will be predisposed to listen carefully to what you are saying. <\/p> <p> <a id=\"get-out\">What do you want them to get out of your presentation?<\/a> <\/p> <p> Once you become familiar with your audience you need to identify the goal of the presentation. If successfully reached, this goal should be of great value to your audience. You must have this clarified before you start adapting the content - it must be based around that goal. If you begin to build your presentation without clearly setting a goal towards a desired outcome it will be just a pointless “show and tell” of a material that everyone can find on their own, read, watch and forget about it sooner rather the later. <\/p> <p> On the other hand, if you begin working on your presentation with a strong belief that it is going to achieve a certain positive change in your audience you will feel inspired and develop a viral enthusiasm that spreads among them. When a presentation is delivered with such enthusiasm and is combined with your passion about the topic it becomes a so powerful that it can open up the minds of your audience and ignite their interest. <\/p> <p> <a id=\"message\">Craft your message<\/a> <\/p> <p> You know who you are going to give the presentation to, you know what you want your audience to get out of it, so now, you need to define your message. You should be careful with this step, because if you get it wrong, or formulate it too vaguely or ambiguously the message will lose its power and will not achieve the desired outcome. All the effort you put into preparation and delivery will not reflect upon your audience and you will be left with a group of people interested in nothing that you want to share with them. The most important test for your message during the preparation stage is to check if you can clearly state it. Do you understand it? Do you think your audience will understand it? Once you have your message and you have YES as an answer to the previous two questions you can proceed with refining it and making it shorter. <\/p> <blockquote>You need to carefully craft a message which will resonate with your audience<\/blockquote> <p> A well crafted message should be concise and written in a simple language that everyone can understand. It must define the theme of your presentation. Ideally, you want your audience to get the message without you explicitly stating it. One good technique to practice writing a concise and simple message is to try to write it in 140 characters or less. This exercise is based on the concept of Twitter messages that are limited to 140 characters. Once you start practicing this technique you will notice how much you can eliminate from your message and end up with a short and clear presentation. This technique and the positives that come with it are explained more in detail by communication expert Carmine Gallo in this article: <a href=\"http:\/\/www.forbes.com\/sites\/carminegallo\/2012\/09\/21\/why-apple-uses-68-characters-to-describe-the-iphone-5\/\"> http:\/\/www.forbes.com\/sites\/carminegallo\/2012\/09\/21\/why-apple-uses-68-characters-to-describe-the-iphone-5\/ <\/a> <\/p>"
}