{
  "id": "design",
  "title": "Design",
  "summary": "<h3>Design<\/h3> <p><em>\"...great slides serve as a visual aid that reinforces the speaker's message.\"<\/em><\/p> <p><em>Nancy Duarte, author of slide:ology: The Art and Science of Creating Great Presentations: The Art and Science of Presentation Design<\/em><\/p> <br\/> <p> When you finish with the preparation stage for your lecture it is time to start designing your slides. Earlier in this book, we discussed different presentation applications that will serve you very well in visualizing your information. Even though some of the tools we mentioned differ significantly from each other, the basic concept that unites them is the same - to provide you with an application with the help of which you will be able to add, organize and present important information to your audience. And that is an art and science on its own. <\/p> <p> In this section we will show you how to create compelling presentations by following certain rules about the choice of visual elements and your presentation's content and structure. <\/p> <blockquote>The presentation is about your audience and their benefit only!<\/blockquote> <p> One of the biggest mistakes which presenters often make is to demand from their audience to take notes and listen at the same time. Do you belong to this group as well? As we mentioned earlier, you can deliver a great presentation only if you leave your ego at the door and realize that the presentation is about your audience and their benefit only! Guess what happens when you try to force the audience to do two things at a time - listen and write - they either do only one of those or lose interest in you and your work. And we don't want to have all your efforts go in vain. Here I will show you how with a few proven and simple techniques you can change your presentation style and engage your audience in your story. <\/p> <p>Overview<\/p> <ul> <li> Prepare a strong introduction <\/li> <li> Authenticity <\/li> <li> How to create a simple, yet effective, visual environment? <\/li> <li> How to create a logical and easy-to-follow structure in your presentation? <\/li> <li> Some additional notes about slide design <\/li> <li> Conferences <\/li> <\/ul>"
}