{
  "id": "evaluate",
  "title": "Evaluate",
  "summary": "<p> Constructive criticism and unbiased argument is pretty much the bulk of what drives everything forward.The communication between you and your audience must be a constant process, not just during your talk, but also before and after. <\/p> <p> I would prefer to call this a feedback loop, since ideas and information should constantly flow between presenter and audience. There are a few methods that can be used to facilitate this loop: <\/p> <p>Anonymous evaluation<\/p> <p>Ask members of the audience to anonymously complete a survey at the end of your presentation estimating your performance based on various carefully designed presentation criteria.<\/p> <p>Q&amp;A Sessions\/Tutorials\/Workshops<\/p> <p>These additional appointments between you and the audience can be digital as well as personal. Teleconferencing is already gathering speed even in the most stubborn and old-fashioned circles and it is something that should definitely be given a shot, since it saves a lot of time for everyone and ultimately delivers the same result as an eye-to-eye meeting between individuals. In these sessions, where there is less pressure to perform as well as matters of time, feedback can be collected either by conversation or by handouts for example.<\/p> <p>Handouts<\/p> <p>As mentioned above, handouts can be very useful as a means of gathering feedback but they have the drawback of taking too much valuable time since they must be completed shortly after the presentation since it must be still fresh in the minds of the audience in order for them to evaluate it carefully.<\/p> <p>Online tools<\/p> <p>There are some tools that you can use online in order to poll your audience, such as online surveys, social networking sites, forums, intranets, etc.<\/p> <p>Another means of being evaluated could be done even before the talk. Practice with a friend or a colleague, especially if the presentation is a one-off and holds a great importance to you and your career. If you can explain the topic to your grandmother, you can pretty much explain it to everyone else. Even if the subject matter is too technical and complex and your friend or relative is unlikely to have the sufficient expertise to judge your performance based on content (delivered both verbally and slide-wise) you should still give it a shot. Any feedback is good feedback and they can still estimate other factors, such as posture, grammar, body language and voice.<\/p>"
}