{
  "id": "foreword",
  "title": "Foreword",
  "summary": "<h3>Why did we write this book?<\/h3> <p> Knowledge is important. And knowledge transfer - the combination of presenting and understanding information, is just as important. Why is it constantly being ruined is a mystery to me. Let’s take a few steps back to get a perspective.<\/p><p>I am a graduate student at the largest research institution on the planet, a host of 27 Nobel Prize laureates and some of the most prominent scientists in the world. As such, I had been lucky to have visited many other institutions in many different countries. There I have been a witness to hundreds of different types of presentation styles. Some of them I loved, but many (way too many to mention) made me yawn like a varsity captain at an advanced calculus class. And slides with a black text on a blue background were not the worst I have seen, believe me.<\/p><blockquote>Knowledge transfer - the combination of presenting and understanding information<\/blockquote><p>Brilliant minds, brilliant ideas and results just bounced off the audience.<\/p><p>The power of exchanging knowledge and moving people towards progress is the backbone of the civilized world as we know it today. But somewhere along the way knowledge transfer has turned into a mundane process that only a handful of people could master. Communicators didn’t care about the impact their work has on their audience. In turn, the audience didn’t care about the communicators or the knowledge they were offered.<\/p><p>Academics and business professionals who were truly masters of popularizing inspiring ideas among others are few and far between. We admire the likes of Steve Jobs, Al Gore, Dr. Robert Ballard, James Cameron and other skilful storytellers, and aspire to one day deliver ideas in just as compelling and mind-blowing way as these presentation greats. Yet, when our moment comes and we are in the spotlight to dazzle and amaze our audience, we put out the worst mixture of text, some images (hopefully), blabbering and uncontrollable, puzzling and comical gestures.<\/p><p>Distractions, stress, chaos that originate from all the noise around us certainly don’t help our cause to become knowledge transfer experts. Mobile devices, apps, TV, the internet and social networks are just a few of the culprits for an overwhelming culture of “business.” It is what prevents us from enjoying a breathing space in our lives that will free us to think and better express our ideas and share the knowledge we have. But there is a     not-so-obvious advantage here which presentation pros have found and used.<\/p><p>The very tools that are now in the wrong hands and used as weapons of mass distraction can be used for the benefit of all as well. There has never been so much freely available information and multimedia content at our fingertips than now. If only we manage to find a way to synthesize the relevant one and weed out the distractions, knowledge transfer will be at least an order of magnitude better. It is the opportunity great presenters have seized.<\/p><p>Realising this and becoming frustrated with the fact that knowledge transfer has become almost a dying art for which nobody seemed to care, I sought the advice and help of a friend.<\/p><p>Marin and I met already at high school and even then we had glorious plans of revolutionizing knowledge transfer. Perhaps it was our shared frustration at math classes, we might never know. Fast forward 8 years and we are sitting in a cafe in Bremen. What was said is not important, but when we closed the door behind us and sipped on a steamy cup of tea, we had an idea - that we must challenge old habits and help communicators improve the way they transfer knowledge. Then and there we started our journey towards defining and exploring the realm of knowledge transfer. And we found out that it is quite big. There were a lot of great expert presenters and wonderful advice that one can find. But how many of us will have the time to go through all this information, considering the busy lifestyle and overloaded attention of the modern professional? Not many. Today, there is a demand for compressed knowledge, to be easily consumed and accessed on demand. People seek out advice that is very practical and universal – core concepts that will serve well in almost every situation.<\/p><p>This book is our attempt at outlining and presenting in an easily digestible format the vast human knowledge about how to best get ideas and information across. It’s about these core concepts of the presentation art that will help you excel the next time you get to speak in front of an audience. Academics, business leaders, marketers, personal coaches, entrepreneurs – as long as you have knowledge to offer to other people this book could help you do that. It will not take you long to read, leaving you with more time to focus on your preparation, design, delivery and evaluation of your work.<\/p><p>If we solve the most fundamental of questions, regarding human knowledge and the transfer thereof (knowledge = information), there is no limit to our progress. With this book we hope to inspire you to take the first steps in becoming a presentation great.<\/p>"
}