{
  "id": "get-familiar-with-the-setting",
  "title": "Get Familiar With The Setting",
  "summary": "<ul> <li>Where are you going to present?<\/li> <li>A note of caution towards using your own machine<\/li> <\/ul> <p> <a id=\"gonna-present\">Where are you going to present?<\/a> <\/p> <p> When you are asked to present it is essential to inquire about the actual place where you will have to deliver. Think of it as the stage for your performance. You want to be familiar with the setting. You also want to make sure that everything will work smoothly without any glitches or interruptions which could turn into unnecessary distractions for both you and your audience. Knowing if you are going to present in a small room or a big hall can give you significant advantage. You need to inquire about things that can directly impact your performance as well. What kind of hardware there is available? Is there going to be a projector in the room? What kind of computer will be able to use? What kind of software will be used? Will you be able to bring our own equipment? <\/p> <p> Bringing your own equipment is probably the safest and most desirable solution. In this way you can be sure that from your part everything will work - your computer will work without any unexpected glitches, you will be familiar with the software, your slides will run smoothly. This kind of control will give you more confidence and you will be able to do your job without worrying too much about things on the side. Your focus will be 100 percent on the task of fascinating your audience. <\/p> <p> <a id=\"caution\">A note of caution towards using your own machine<\/a> <\/p> <p> If decide to use your own device during your presentation you should take extra care of tidying up your desktop screen and make it look as organized and as uncluttered as possible. Why should you care about this? Because first impressions are very important and seeing a screen filled with scattered icons and files all around the place will not leave a very good one in your audience. I have been through many presentations where the presenter starts a computer and you see a mess, comprised of text documents, folders, program icons and pretty much everything else you can find on a computer. Once you see this you cannot help but think that the person in front of you lacks a simple organizational sense and does not care much about structure or aesthetics. Oh and make sure you change your favourite background image from your summer holidays where you are in your swimming trunks with something more...neutral! <\/p> <p> Don't forget your audience's experience either. Check how far the audience will be seated from the stage? Will you need a microphone? Will the people sitting in the back rows be able to hear you? Will you be able to hear them if they interact with you? Will they be able to see your slides? You need to take these factors into consideration when you prepare your lecture. Include larger imagery in your slides if you are going to present in a bigger room. It is easier to make a connection with your audience in a smaller room, presenting in front of a small group of people. In big rooms or auditoriums most people intuitively sit at the back rows, leaving a distance between them and you. Be prepared to ask them to sit in the front rows. <\/p> <blockquote>Include larger imagery in your slides if you are going to present in a bigger room<\/blockquote>"
}