{
  "id": "introduction",
  "title": "Introduction",
  "summary": "<p> A year ago, when I started working on this book I intended to create a very concise blueprint about creating great presentations. I was inspired by the people who have mastered the art of presentations and wrote books about it. I was also inspired by those whom I call natural presenters - remarkable characters from different areas of life who managed to transform knowledge in a fascinating way, so that their audiences really grasp the issues and are inspired to act on the message being delivered. These masterful storytellers captivated everyone’s attention not just by cleverly designed visual aids or their natural charisma and gift to talk. No, there was something else as well. </p> <p> I could not really put my finger on what it was at first, but after giving it some thought I realised something: the presentations were delivered with the utmost professionalism and the presenters spent hours, weeks, and probably months, in preparation for this exact moment when they take the stage to address the audience. It could easily be seen that these talks, demonstrations, keynotes (or whatever you choose to call them) were crafted up to the smallest detail and were work of perfection. Perfection that one does not achieve in a few hours by simply starting PowerPoint and quickly filling in the information that is required moments before the presentation is due. These presentations were made with care and a lot of effort went into them. Effort that did not begin with a double click on the presentation software icon on the desktop and ended with a single click on the X mark in the top corner of the program window. Instead, it was a process that started much before the double click and lasted much longer than the single “X mark” click. All these presenters spent many hours preparing and designing their work, and were going to spend many more evaluating and improving it. </p> <p> The connection between preparation and evaluation in order to design and deliver a truly great presentation became something of an obsession to me. It made quite an impression and I decided to focus on these four essential processes and the way they make up the art of presenting. Because there is no place for mediocrity in this world of knowledge transfer and there are way too many bad practices and complaints about presentations being boring. In fact, I believe that presenters who allow for mediocrity in their work and fail to demonstrate how interesting their knowledge can be are committing a crime against their audience, but also their peers and fellow professionals. Instead of inspiring people with new ideas and concepts they manage to turn knowledge into something that leaves a bad aftertaste. And how can knowledge be that? Knowledge is what we humans cherish greatly. To allow others to fail in the practice of knowledge transfer by decreasing the value of knowledge must not be tolerated! </p> <blockquote>There is no place for mediocrity in the world of knowledge transfer</blockquote>  <p> Therefore, I am embarking on this quest to fight the innate laziness of most people when it comes to presentations and show the important and essential elements to the preparation, design, delivery and evaluation of a presentation. Hopefully, I will convince you to spend a bit more time preparing for your next presentation and will ask you not to stop after your “Thank You!” slide. Because this is the only way to reach presentation greatness, earn the admiration of your audience and become a knowledge transfer guru (KTG). </p>"
}