{
  "id": "know-your-material",
  "title": "Really Know Your Material",
  "summary": "<p>Before you start working on your presentation you should make sure that it is on a subject related to a field with which you are closely familiar. You have to be careful not to choose a subject area that you know very little about. Otherwise, you might end up sounding like a complete idiot and that will not go down well with your reputation. To avoid that, there are three questions about the topic of your presentation you must ask and answer yourself:<\/p>          <ul>            <li>Are you an expert in the field?<\/li>            <li>Do you have an overview of the field your topic is part of?<\/li>            <li>How does the topic fit within your field?<\/li>          <\/ul>           <p><a id=\"expert\">Are you an expert in the field?<\/a><\/p>             <p>Wikipedia defines an expert as “a person with extensive knowledge or ability based on research, experience, or occupation and in a particular area of study.\"<\/p>             <p>You need to have extensive knowledge about the topic you are going to talk about during the presentation. Being knowledgeable will immediately be noted by the audience and they will feel much more comfortable with you. Moreover, the level of credibility and trust is much higher with knowledgeable people, than with those who have barely (if any) know-how of the field. You will also be more confident that your presentation will turn out to be a success. Last, but not least, your preparation time will be significantly shorter if you have the necessary knowledge.<\/p>  <blockquote>Being knowledgeable will immediately be noted by the audience and they will feel much more comfortable with you<\/blockquote>            <p>In case you have to give a presentation on a topic that is not directly related to your field of expertise you should try to seek the advice of your peers and\/or respected professionals who have that kind of knowledge. Asking for help is a perfectly normal thing to do - it shows that you care about your audience and you are aware of your limitations. Most people also appreciate it when you ask them for advice or assistance. Furthermore, such a situation presents you with an opportunity to expand your professional and personal networks.<\/p>            <p><a id=\"overview\">Do you have an overview of the field your topic is part of?<\/a><\/p>             <p>Being an expert means you have the knowledge about the field, but it may still take you lots of time to go over all the information and find the bits that are related to the topic. Once you know the topic of your presentation you must make an overview of all the relevant material that will form the content. This practice will serve you in two ways - first, you will refresh your knowledge and, second, you will be able to quickly answer questions that arise during or after the lecture. Another benefit of having the necessary information at your fingertips is that you will spend less time preparing what you will tell and show the audience.<\/p>             <p><a id=\"topic\">How does the topic fit within your field?<\/a><\/p>            <p>In what way is your content connected to your field? Is it about a new development or is it challenging established beliefs? It is essential you clarify this, because it will shape your approach to the way you structure your presentation. Defining where your topic fits will also help you identify other similar and relevant works by other professionals. You have to expect that your audience will show significant interest in the topic you present and will seek complementary information, covering the similar subject. If you are able to provide additional sources and references to other relevant works, people will appreciate this and you will gain even more trust and credibility.<\/p>"
}