{
  "id": "plan-before-you-start",
  "title": "Plan Before You Start",
  "summary":"<p>Planning is the next step of your preparation. The planning stage will give you a better overview of how much time you have available for working on the presentation in your schedule and it will also let you set clear steps and deadlines. Having such a planning is an invaluable tool for committing to work. After you have a plan with clearly defined steps and deadlines you must focus on choosing the right tools that will help you deliver the ultimate presentation experience. The choice of tools is very important, because it will have an impact on the way you work until your presentation is over and sometimes after that (more about this later). It is essential to choose the right tools for your purpose - using a multimedia presentation is not always necessary for you to present your ideas! When your plan is complete and you know which tools you will use you need to take a moment to find and collect the additional material which will enrich your content and provide that extra special value to your audience. These could be brochures, copies of the report you are presenting, or even the product if you are introducing a new addition to your product portfolio.<\/p> <p>Here an interesting metaphor reminds me of one very cool guy you have probably seen on Discovery Channel - Bear Grylls. As an experienced climber he very often uses the same word - commit. For Bear Grylls it means going over that one step further, to the place from which there is no coming back. Even if you don’t know what lies ahead, you have already committed yourself and cannot go back.<\/p> <p>In a similar manner, you should regard your preparation like a preparation for climbing. Trust me, you don’t want to go hiking before you see the mountain. Use the word commitment in the positive way. Commit to success, do that harder hurdle step of preparation and this investment will pay off.<\/p> <blockquote>Commit to success, do that harder hurdle step of preparation and this investment will pay off<\/blockquote> <ul> <li>Assign Sufficient Time to Prepare Your Presentation<\/li> <li>The Danger of Getting in the ZONE<\/li> <li>Productivity Tools<\/li> <\/ul> <p><a id=\"assig-time\">Assign Sufficient Time to Prepare Your Presentation<\/p> <p>Let's face it - today we are always complaining of not having enough time for our work, let alone our personal lives. Most people struggle to find a balance between work and life. Business coaches, personal advisors, and gurus of all sorts are publishing book after book on how you should manage your time and how you can improve your lifestyle, productivity, or relationships. Personally, I believe that I have found the solution to this issue - SET THE TIME! Working at various marketing departments of big organizations and course-related projects at my university, I have observed that the people and practices considered to be successful are those which were led by a detailed, strict planning, task setting and most importantly - time allocation.<\/p> <blockquote>SET THE TIME!<\/blockquote> <p>The same goes for presentations. Setting time and defining tasks gives you a clear bird’s-eye view of what the project you are faced with will require in terms of effort and time investment. Here is how you should proceed. First of all, look at your overall schedule and decide what will be the most convenient period for you to focus exclusively on developing your presentation. Make a note that you might have to reorganize things a bit, especially if you don't have a clear schedule for your other work and personal engagements. After you know which period best suits you to focus on the preparation you can proceed with setting a timeframe that you consider will be sufficient for it. It is up to you to decide how much time for preparation and production you will need - everybody's work styles differ and you might be able to prepare, design and deliver your presentation in a few hours as well as a couple of days, if not weeks or months. Your next step will be to define each task necessary for the successful execution of the presentation. This will help you to check what resources you will require.<\/p> <p>I'd like to make a short note about the order I outlined above of assigning time and then defining the steps for the preparation of the presentation. Usually, the practice is to first define the tasks (what you have to do) and then, depending on their complexity, to assign a time (how long will it take) to complete each one. This might have worked in the past, but not anymore. In a world where distractions occupy both the physical and digital worlds, we are struggling to dedicate our attention exclusively on a particular task. The result is that we are constantly faced with the problem of not having enough time for anything, constant complaining, and the lack of spare time for relaxation. The solution, however, is quite simple. Turn the process around - first set a time (preferably a tight schedule) and then outline the tasks you need to complete within this timeframe (think about your days at college and that final report of the course due the next morning). You will be amazed at the result - when faced with a fixed deadline your productivity will increase dramatically, you will stay focused on the work and as a consequence you will prepare your presentation in less time than if you do it the other way around.<\/p> <blockquote>First set a timeframe, then outline the tasks you need to complete<\/blockquote> <p><a id=\"zone\">The Danger of Getting in the ZONE<\/p> <p>Setting a deadline is a fantastic way to ensure that you will be motivated to finish working on your presentation on time. However, you should also consider when to set this deadline. You should do it with this in mind – don’t leave the preparation and the design until the last moment! Always plan in a way that leaves you with extra time for changes, corrections or unforeseen issues. You can plan all you want, but things can still go wrong.<\/p> <blockquote>Don’t leave the preparation and the design of your presentation until the last moment!<\/blockquote> <p>It is not uncommon for people to adopt a mindset that Zero or Only Necessary Effort (ZONE) on the preparation and design of a presentation will be enough to ace it. It’s a huge misconception that usually leads to bad presentations and bored audiences. It is easy for all of us to fall victims to the “busy” trap of everyday life – we have plenty of responsibilities at work and in our personal lives which preoccupy our attention, so when we are handed the task to deliver a presentation we postpone the preparation and design until the very last moment, right before we are due to present. Then, no matter your skill and knowledge, you fail to deliver the ultimate presentation experience.<\/p> <p>Failure to prepare sufficiently could lead to you becoming over-reliant on your slides. Remember – you should be at the centre of your presentation, do not put all the substance and attention on the slides – they are a visual aid, one of the many tools at your disposal. What happens if you do that is that you are more likely to add too much information in the deck with the intention to help yourself during the delivery of the presentation. But that will work against you, because you will appear unprepared, look often at your slides, read from them, skip eye contact with the audience and eventually, distract them and yourself.<\/p> <blockquote>Failure to prepare sufficiently could lead to you becoming over-reliant on your slides<\/blockquote> <p>Instead, acknowledge that your presentation will require you to put the necessary effort in it if it is to be a success. Start work on it as early as possible and have it ready at least a few days in advance, even a week if possible. This time will be enough to review the presentation, identify parts that could be improved or that seem unnecessary. Moreover, you can use the extra couple of days to collect feedback from your peers, as well as be prepared to react to unforeseen issues that may arise. Having this longer period of time before you have to deliver the presentation will give you piece of mind and confidence that the whole event will perform like a true KTG.<\/p> <p>So, you set the time and the tasks needed to prepare the presentation. Next, you have to take a look at the tools you will use for the preparation, design, delivery, and evaluation of your presentation.<\/p> <p><a id=\"productivity\">Productivity Tools<\/p> <p>...TO DO...<\/p>"
}