{
  "id": "prepare-strong-introduction",
  "title": "Prepare A Strong Introduction",
  "summary": "<p> Your presentation should be structured in a way that incorporates an introduction to the topic that will help you set the stage for the knowledge you are about to transfer to your audience. It does not make sense to jump directly to the core of your presentation without a warm up. In fact, you should be looking at your introduction as a proper warm-up for the brains of the audience. Such an activity will serve as a signal to the mind that you are about to share interesting and important wisdom. <\/p> <ul> <li>Why you need a strong start?<\/li> <li>A strong introduction will make a positive first impression on your audience<\/a><\/li> <li>You made a strong first impression – you have won the attention of your audience<\/li> <li>A good start will establish your credibility<\/a><\/li> <li>A strong introduction will set the tone for the rest of the presentation<\/li> <li>Tools to help you make a strong introduction<\/li> <\/ul> <p> <a id=\"strong-start\">Why you need a strong start?<\/a> <\/p> <p> There are many reasons that make a compelling case for the use of a powerful introduction to your presentation. Here are four I consider to be the most important ones: <\/p> <p> <ul> <li>making a positive first impression on your audience<\/li> <li>winning the attention of the audience from the very beginning<\/li> <li>earning credibility for the presenter<\/li> <li>setting the tone for the rest of the presentation.<\/li> <\/ul> <\/p> <p> <a id=\"first-impression\">A strong introduction will make a positive first impression on your audience<\/a> <\/p> <p> Let’s face it – we are judgmental creatures, especially when we are faced with new information, like meeting people for the first time or attending a presentation about the latest smartphone by company XYZ. We will quickly make assumptions about the unknown things, letting the brain fill in the blanks with made up information based on our expectations and previous experiences. That will play an important part when forming our first impressions about this new information. These first impressions can be very hard to change later on, especially when the time people have to form new ones is limited, as is the case during presentations. <\/p> <blockquote>A strong introduction will make a positive first impression on your audience<\/blockquote> <p> The impact of first impressions could be so big that it can make or break your presentation before you even had the chance to get to the “juicy”, exciting part of what you have prepared. If you make a good first impression people will be interested, their curiosity stimulated and they wil want more. However, if you fail to make a positive first impression, you will most likely cause a sort of mental fatigue in your audience. They will consider it a weak performance from you and a waste of their time. And this is the nightmare scenario every KTG wants to avoid! <\/p> <p> <a id=\"attention\">You made a strong first impression – you have won the attention of your audience<\/a> <\/p> <p> Engaging the audience in a strong introduction at the start of your presentation will win you this sought after gift of attention that is absolutely necessary if you are to successfully achieve your goals as a KTG. Once you have the attention of your audience it will be easier for you to transfer the knowledge you have prepared and for the audience to understand it. You will have sound communication with them that will have an impact. Attention could be the facilitator that opens up the minds of your audience. <\/p> <blockquote>Attention could be the facilitator that opens up the minds of your audience<\/blockquote> <p> That is why attention is so precious. As a KTG you should work hard to earn the attention of your audience and really appreciate it when you have it. Don’t forget to make the most of it either! Because it took a lot of effort to gain it, but in just a blink of an eye, one small mistake from your side, an unanticipated distraction and you have lost it. <\/p> <p> <a id=\"credibility\">A good start will establish your credibility<\/a> <\/p> <p> A strong introduction will have the benefit of establishing your credibility among members of the audience. As a KTG you need this credibility if you are to be trusted and considered an expert. Once these pieces are all in place you will have a much easier job to achieve what you set out to do, because the audience will respect you and will be interested to hear what you have to say. Moreover, you are not only earning credibility for yourself, but for your field of expertise also. So, the interest in your own persona transfers to the area you are presenting and this might inspire people to further inquire about it later on. <\/p> <blockquote>Earn the respect, trust and interest of the audience by establishing yourself as a credible expert<\/blockquote> <p> Without credibility there will be hardly any interest form the audience towards your knowledge and you will fail as a KTG. If this happens there is the danger of damaging your reputation, but also the reputation of your professional field. Therefore, it must be one of your top priorities to ensure you earn the respect, trust and interest of the audience by establishing yourself as a credible expert. <\/p> <p> <a id=\"tone\">A strong introduction will set the tone for the rest of the presentation<\/a> <\/p> <p> It really matters how you start! Start strong, with an introduction charged with energy and you will transfer this to your audience who will engage with you and your presentation until the end. Show everyone that you know what you are talking about and ignite their curiosity from the beginning and they will stay involved with the content. If you make people feel good, interested and excite them in the beginning they will create similar expectations for the entire presentation. When the tone and environment are charged so positively from the start your job as a KTG will be much easier. <\/p> <blockquote>Without the interest and open mindedness of your audience you risk losing them as listeners<\/blockquote> <p> On the other hand, if you don’t provide the strong introduction I’ve been talking about you risk missing out on all the goodies I just mentioned. Without the interest and open mindedness of your audience you risk losing them as listeners and that is detrimental to what you are trying to achieve. They will be bored from the start and could easily stay that way until the end. <\/p> <p> <a id=\"tools\">Tools to help you make a strong introduction<\/a> <\/p> <p> Here are a few tips and tricks you can use in your presentations that will turn you into a true KTG and leave your audience wanting for more: <\/p> <p> <ul> <li>tell a story relevant to the setting and the audience<\/li> <li>use metaphors and analogies<\/li> <li>challenge assumptions<\/li> <li>use humour.<\/li> <\/ul> <\/p> <p> Tell a story relevant to the setting and the audience <\/p> <p> Opening up your presentation with a story is a nice way of starting. In fact, your whole talk should be one longer story, but consider beginning with another, shorter one. What is important of that story is that it must be relevant to your audience and to the environment. For references you can look at well-known recent events, pop culture, industry-specific anecdotes, even some stereotyping could be implemented (but careful with that one – you don’t want to offend someone). Answer yourself the question “What are my audience’s interests? What sparks their curiosity?” and that will give you enough material to create a story or use an existing one. <\/p> <blockquote>Opening up your presentation with a story is a nice way of starting<\/blockquote> <p> Bear in mind that you don’t have to focus too much on this element. After all you are there to transfer important knowledge and not to solely entertain. Refrain from turning your presentation into a one-man, storytelling show. What you should keep in mind all the time is that the story you choose to tell must have a point and it must slowly, almost unnoticeably, carry your audience to the main part of the presentation. If you are feeling even more adventurous you can even use a story that will pose an open question, the answer to which you reveal at the very end of the talk. This way you are taking the audience, full of attention and curiosity, on a mental journey to the a-ha moment in the presentation. <\/p> <p> Use metaphors and analogies <\/p> <p> The worlds of language and literature have given us a wide variety of tools to describe one and the same thing in different ways. As a KTG you must learn to use these tools and implement them in your work. A presentation can have a very strong introduction if the presenter begins with a powerful metaphor or analogy. However, you should carefully choose the metaphors, in order to avoid confusion and sounding pretentious. Also, make sure that they are relevant and make sense. Use them only if you are certain that they will add value to your presentation and will not distract people from the actual topic. <\/p> <p> To find inspiration on the types of metaphors and analogies you can use consider the profile of your audience – the kind of jargon they use, problems they are faced with at work, problems they encounter outside work, the entertainment they consume (movies, music, books, games, pretty much anything that comes to mind which is not strictly work-related), relationships and families, etc. Finding resonance with what you are talking about is key here. <\/p> <p> Challenge assumptions <\/p> <p> Another way to make a strong first impression during a good introduction is to challenge assumptions that the audience might have. This should be done only if you are sure that there is substance to your statement and you are not just trying to convince the audience that “Red is blue” and “they have lived their lives in complete ignorance.” <\/p> <p> When you go in this direction you achieve a dissonance between the expectations and knowledge people have and what you are telling them. Once again, if you make such a statement make sure you have the evidence to support it, otherwise you will alienate the audience (which is contrary to what you must try to achieve). This dissonance will play on the curiosity of your audience and with their inquisitive minds they will open up to new evidence and knowledge. And then, if you really have made a ground-breaking discovery, you will have a great opening to share the exciting news. <\/p> <p> You can also challenge assumptions by disproving common wisdom. We are surrounded by common wisdom in both our professional and personal lives. Sayings, cultural beliefs, outdated research and scientific discoveries are just a few of the contributors to some of the common wisdom that is out there. A lot of what we do and how we live is being governed by this type of information. So, if you have knowledge that contradicts with any sort of common wisdom feel free to shout it out in front of everyone without any hesitation. After all, you have contributed to human progress. <\/p> <p> In case you feel that what you have to share needs an even bigger and louder entrance then start by making an “outrageous” statement. Say something that no one could imagine saying. The more important your revelation the more “outrageous” you should be. Shock could be a powerful ally in a presentation. You will certainly be not boring. A word of caution again – make sure you know the audience well before you do the “outrageous” statement. People might get offended and if that happens they will close their minds towards you and the information you have prepared, causing you to fail as a KTG. <\/p> <p> Use humour <\/p> <p> This last technique is a sure way to success. A well placed joke or a humorous remark works wonders with your audience, especially in the beginning of the presentation when you are not familiar with each other and trust is still shaky. Sharing a laugh is a great way to make people feel comfortable and that makes your job as a KTG much easier. When there is a light-hearted atmosphere in the room, keeping an open and curious mind is easier, keeping attention is easier, trust happens naturally. And that is a fantastic way to start a presentation. <\/p> <p> Consider starting with a funny story from your professional experience. Direct the humour to a previous failure of yours or an unfortunate situation that you found yourself in while on a business trip – the repertoire could be endless here. You can even try to mix things up a bit and try a humorous metaphor! And don’t stop at the beginning. It will be disappointing for the audience if you overpromise with laughter at the start and turn the rest of the presentation into a snooze fest. So, just add a funny remark every once in a while during the whole talk (if appropriate, of course). <\/p> <p> With humour, as with all the other techniques I outlined above, be mindful of the language and content you choose. Try not to use too expressive a language which might offend the more conservative part of the audience. Also, avoid sharing stories that involve people who are present in the room or are known to the audience. Changing names and a few situational facts can spare you the blushes after the presentation. Don’t forget to always consider the feelings of those you work with! <\/p>"
}