{
  "id": "presenting-at-conferences",
  "title": "Presenting At Conferences",
  "summary": "<p> The Speech <\/p> <p> If you are presenting during a conference you should take your time to design your speech as well. At such high-profile events you need to be at your A-game. The audience will consist of your peers and other professionals who are renowned experts in their respective fields. You have to be careful with the way you present your work and you must pay attention not just to your slides, but also to your speech. You will be much more relaxed if you stand in the spotlight knowing what you want to say. Preparation in advance can give you the confidence you need to fight the butterflies in your stomach when you get on stage. <\/p> <p> You need to be very careful with the words you use. You should aim to be clear and coherent, and to avoid any unnecessary words. You cannot afford to lose the attention of your audience during your presentation. Start rambling or forget what you want to say and it is all going to go downhill from there. It happens quite often that people who don't prepare their talks forget what they want to say (usually because they are distracted from being under pressure) and turn to read from the slides on the screen, turning their backs to the audience. In such a situation one loses not just time, but also the contact with the audience. <\/p> <p> There are a couple of simple, but very effective practices that you can do to make sure that during your next audience you will own the room. First, and most important of all, write down your whole speech. You need to put all the words you are going to say on paper. Write down everything and start from the very beginning - from the moment you open your mouth and greet everyone, until the moment you say thank you at the end. Every word needs to be on paper. You will be amazed how much easier it will be then to come up with the right words while you are on stage. You will be walking a road you are already familiar with. <\/p> <p> Second, rehearse your speech. Once you write it down make sure you practice it until you know it almost by heart. Try to stick to the words on the paper as much as possible. Avoid adding things. What you wrote down must be more than enough and anything new you add will distract the flow of your speech. The more you practice it, the more confident you will become, and the easier it will be for you to deliver it. Furthermore, while you are rehearsing, time yourself and mind the speed and tone you use when talking. Make sure you are speaking coherently and loud enough so that everyone in the room will hear and understand you. Try to find the balance between whispering and shouting though, because going in any of the extremes will have a damaging effect on your performance. <\/p> <p> Third, look at the language you are using. Try to add adjectives and other words that will make your speech sound more emphatic and enthusiastic. Your speech must be powerful enough and expressive to resonate with your audience. Do you want to achieve something with your presentation or are you there just to say what you want to say and leave afterwards? If it is the second, you might as well ignore everything you've read until now. But in case you have a reason to be there and you are on a mission then you need to pay extra attention and effort to the language you use. <\/p>"
}