{
  "id": "setting-the-stage",
  "title": "Setting The Stage",
  "summary":"<ul> <li>Arrive early<\/li> <li>Check that everything works<\/li> <li>Mingle with the audience<\/li> <li>Project confidence<\/li> <li>Choose clothes carefully<\/li> <\/ul> <p> <a id=\"arrive\">Arrive early<\/a> <\/p> <p> Be at at the place where you will present well in advance. This is especially important if you are attending a conference or a similar event of higher importance. Try to be in the room before everybody else arrives. This will give you the opportunity to do two very important things - first, make sure that the computer, projector and presentation work, and second, in case anyone arrives early you can mingle with the crowd and make them comfortable by engaging in a friendly talk. <\/p> <p> <a id=\"check\">Check that everything works<\/a> <\/p> <p> To deliver a powerful presentation you have to eliminate distractions as much as possible. One of the most common ways to lose the attention of your audience is to allow technological disruptions. For example, your projector doesn't start automatically and you have to switch it on manually. As amusing it might be to grab a chair, stand on it and look for the right button, you will lose precious time and focus. Another one is to have your computer not responding to your commands - you want to start the presentation software, but the computer is still logging you into the system. These might be small things, but dealing with each of these can have a disastrous effect on your presentation. <\/p> <p> Therefore, give yourself at least five minutes in advance (if possible more) to get everything running. In case you bring your own equipment you have to make sure that it is compatible with the plugs (and other infrastructure) in the room. Do you have the right cable to plug the laptop in the projector? If you are going to another country check the power plug standard - you might need to use the electricity in the room. If you need Internet, take the time to set up the network. Check for help from IT support if you cannot do it on your own. If the equipment is already present check how and if everything works as you like it. Does your presentation run properly on the computer. Presentation files made on different version of the same application might appear different from you what you planned and expected them to be. This is rarely the case nowadays, but make a note of this and always check. Don't leave it until your audience is in their seats, waiting for your presentation, to start it and see that what appears on the screen is a freak version of your slides. I suggest you make a PDF extraction of your slides, so that if something doesn't work, you can open the PDF and do the presentation like that. Your slides will look exactly as you intend them to be and you wouldn't have to worry about different versions of the presentation software. Mind though, that animations and other effects you've added will not be shown if you use PDFs. Nevertheless, it's a good back up plan. <\/p> <p> I want to make a point about lightning. It is my personal experience that presenters rarely take into consider the light in the room and when they start their presentations all I can see are some shapes and words that I could barely distinguish. The problem is that not all projectors are powerful enough to transmit the same quality of colours as you intended it to be. That is why you need to know this and dim the lights or pull the blinds down to make sure that your audience will see what you want them to see and not just some blurry images. It is a big mistake to leave people guessing what you are showing them. Some might get a completely different interpretation of the material. <\/p> <p> The best thing to do after you've made sure everything works is to have the presentation loaded, your title slide on the screen and wait to greet your audience as it arrives. <\/p> <p> <a id=\"mingle\">Mingle with the audience<\/a> <\/p> <p> Make yourself approachable and inviting before you begin your lecture. Think of this as getting to know the people who are going to listen through your lecture. It is also a great technique to relieve tension and make everyone feeling relaxed. <\/p> <p> Why bother getting to know the audience? Well, for starters, you will start a relationship with them and establish trust. This is essential if you want your audience to listen to you with full attention. Do you want them to understand the topic and get them thinking about it? Then you need them to trust you. If you don't perceive a person as trustworthy you probably won't care what he is saying at all. <\/p> <p> You need to take into consideration that there is always tension between you and your audience. You might be getting stressed about presenting in front of other people, especially if you don't know them too well. Your audience might feel the same way about you. They might not be comfortable to ask question or to challenge your points. That is why you have to make the effort to stay approachable and relaxed and try to transfer this to your audience. The moment you become closer to the people you are going to talk to the barriers will disappear and the tension will be eliminated. <\/p> <p> You begin your presentation when you first meet your audience. This is the start - the moment you create the connection. Think of other ways that can help you build a stronger relationship with your audience. They will appreciate it and listen to you carefully, with complete attention and interest. <\/p> <p> <a id=\"project\">Present with confidence<\/a> <\/p> <p> The way you present is what can make your lecture a success. You might have the best and most interesting material on the planet to show your audience, and you can have the most beautiful slides, but if you fail at the way you communicate this in an appealing way, your whole presentation will fail to deliver to its promise. You have to be aware of your body language, voice, keeping eye contact, your attitude, and your confidence, and manage these during the presentation. If you can master all of them you can be certain that you will successfully deliver something special. <\/p> <p> <a id=\"wear\">Choose clothes carefully<\/a> <\/p> <p> You have to consider the clothes you are going to wear during your presentation. There is one very important rule – whatever your choice of clothes, it has to be comfortable both for the body and the mind. <\/p> <p> First, consider clothes that are comfortable to wear. You need to feel as if you are in a second skin. You should barely notice that you are wearing them – they should provide all the comfort you require. Discomfort can be a really big issue during presentations. You don’t want to stand out in front of the audience and be distracted by an itch or tightness here and there. They will notice your struggle and that could have a negative impact on your performance as a KTG. Wear clothes that will allow you to move freely (you don’t want something tearing because you stretched too much trying to illustrate your point) and that do not irritate your skin. You probably already know what feels good to wear and what you would avoid at all cost – make your decision based on your experience. <\/p> <p> Then, comes the matter of clothes that are comfortable for the mind. These are clothes that make you feel good about the way you look and are presenting yourself. In our heads we all have this perfect image we aspire to achieve when we appear before others, especially during presentations. Therefore, to make sure that you get that extra bit of confidence when you take the stage, wear clothes that will take you as close as possible to that perfect image you are aiming for. <\/p> <p> Still, you cannot consider comfort as the sole factor when choosing your clothes. You must pick clothes that are appropriate for the occasion and in line with the expectations of the audience. Also, when you select your clothes think if they can help you reinforce the point you are making in the presentation – your appearance can be a great communication tool. This means that you should carefully choose the colours. Depending on the topic of the presentation and the setting in which you will be working you might want to go for a specific combination of colours that can further the impact of your performance. <\/p>"
}