{
  "id": "sketch-your-slides",
  "title": "Sketch Your Slides",
  "summary":"<p> Many people who have to prepare a presentation jump immediately to the presentation software and start putting together their slides. This usually produces mixed results and takes much more of your time than necessary or planned. This is why you need to take a step back after you have decided what content you will include in your presentation and turn off the software. Go analog! Take a pen and paper instead (or find a whiteboard near you) and try to sketch the slides you would like to include. Going through this step will help you to clarify the structure you want your presentation to follow. What you aim for at the end is a storyboard of the content which you will present during your lecture. With the storyboard in place you will then be able to apply the necessary corrections to your slides. <\/p> <blockquote>Go analog! Take a pen and paper and sketch the slides you would like to include<\/blockquote> <ul> <li>Creating a storyboard<\/li> <li>Removing unnecessary slides<\/li> <li>Mindmapping<\/li> <\/ul> <p> <a id=\"storyboard\">Creating a storyboard<\/a> <\/p> <p> This is a highly underestimated technique which if you decide to use is going to simplify the process of designing your slides and crafting a compelling story while saving you considerable amount of time and effort. When you stand in front of a blank piece of paper or a clear whiteboard your creative juices start flowing, you come up with great ideas. You are unrestricted by text boxes, heading styles, themes, and other standardized elements of the presentation software. New designs can be created in this way, so they fit best the purpose of your presentation. Furthermore, you will be able to see for yourself how the story will spread over each slide and in what order. Working with a storyboard is very helpful, because it will give you a panoramic view of the content you want to present. In addition, the time you spend developing a storyboard will drastically reduce the time you will spend in front of the computer. By the time you switch on the software you will know what kind of multimedia and how much text needs to go on each slide. Then, you can spend less than an hour to fix the content of your presentation. <\/p> <blockquote>Working with a storyboard is very helpful, because it will give you a panoramic view of the content you want to present<\/blockquote> <p> <a id=\"unnecessary\">Removing unnecessary slides<\/a> <\/p> <p> While working on the storyboard you will also be able to reorganize your presentation and dispose of unnecessary slides that do not bring any real value to your presentation. If you have a huge stack of slides it doesn't mean that you have a good presentation. Quality, not quantity is what matters in presentations. Furthermore, the quality will suffer if you allow for clutter in your presentation. That is why it is better to outline all the slides you think need to be included, carefully think through how much of the information you can present through multimedia objects, and remove the unnecessary material. It is easier to make that change while still on the drawing board. Once you start putting content on the slides it will be more tempting to leave it as it is than change and remove - you wouldn't feel comfortable changing things in the last moment. And the time you spent filling all the unnecessary slides will be lost. You cannot afford that. <\/p> <p> You would be surprised at the amount of information you can compress and present on just a handful of slides. You don't need 50 or more slides. You can fit enough content on as many as 20 slides. And you should constantly challenge yourself to decrease this number. Do that and soon enough you would be able to hold hour long presentations with just five slides. We challenge you to try this! <\/p> <p> <a id=\"mindmapping\">Mindmapping<\/a> <\/p> <p>...TO DO...<\/p>"
}