{
  "id": "what-is-ktg",
  "title": "The Knowledge Transfer Guru",
  "summary": "<p><a id=\"ktgis\">What is a KTG?<\/a><\/p> <p> I don’t believe that the word ‘presenter’ is sufficient when talking about those whose career is focused on informing, inspiring and changing people. It is a fair description of someone who is currently in the act of presenting, but as I mentioned earlier, a presentation does not only encompass the event of delivery of information or design of the slides. It takes a lot of effort to prepare and evaluate (collect feedback and improve) the presentation. So, calling someone a ‘presenter’ would be an injustice towards the person we are listening to. <\/p>  <blockquote>A presentation does not only encompass the event of delivery of information or design of the slides<\/blockquote>  <p> ‘Communicator’ is a much more accurate way of describing someone responsible to enlighten the audience. A communicator would invest a great deal of his time and energy to collate knowledge from a certain field, transform this knowledge into a digestible material for a wide audience and aim to share it with as large an audience as possible. He is a true believer in his work and will not shy away from doing extra work and spend long hours making sure that he achieves his goals. However, the word ‘communicator’ has too broad a meaning. A communicator is someone who is responsible to inform, inspire and change people and their beliefs towards various subjects from his field, but it could also be a teacher, a marketer, a public relations officer and many more. Therefore, a different description is still required for the type of person we admire and want to become by mastering the art of presenting. <\/p> <p> Knowledge (or information - I will use them synonymously here) is the currency our main character works with. He collects knowledge through his own and other experts’ experience, works out the best way to put this information in a form that is digestible for others, delivers a compelling message based on this knowledge and listens to feedback from his audience. This process is the event of knowledge transfer. It is an event that happens in many different forms and environments. Every time someone prepares on a topic, delivers information that is interesting to us and notices our reaction - knowledge transfer occurs. A person who is able to master such a process I call a Knowledge Transfer Guru, or KTG. <\/p> <p> The KTG will not stop at anything to prepare the most stunning presentation through which he can leave a lasting impression in the audience. His work is so good that it leaves the audience in awe and they talk about it for a long time after they’ve witnessed it. They not only talk about it - they act on the message that was delivered, be it a call to start creating more sustainable communities, embrace a new way of thinking about an existing problem, or buy the latest phone from company XYZ. The KTG does not have a problem with gaining attention or losing it. His performance is so great that the audience would not even dare to get distracted because it is afraid it might miss out on something that was said or showed during the presentation. The KTG knows that these are all the fruits of an extensive preparation process where nothing is left to chance. All elements of his presentation - visuals, talk, body language - are carefully planned, designed, rehearsed and tailored in a way that will best evoke the desired response from the audience. Furthermore, the KTG will embrace an open communication process with his audience in order to better understand their needs and interests. This information will later serve him well in redesigning his presentation and deliver an even better performance next time. <\/p>   <p> In short, the KTG is the type of well-known figure we admire for his presentation skills and desire to be like him when making our own presentations. It’s the person we look at for hints and tips to improve our presentation skills. In the following pages I will discuss the best practices you can apply to your work the next time you have to make a presentation. These are by no means rules that you have to stick 100% to all the time. Rather it is advice that will put you on the way to becoming a KTG. <\/p> <p> <a id=\"excellence\">Why should you care about excellent presentations?<\/a> <\/p> <p> Because it is the only way to be sure that your work matters. Presenting a piece of work in its best possible form is the necessary ingredient to really make a standout presentation and move your audience. Only then you can count your presentation as a success. <\/p> <p> Furthermore, a true KTG will never compromise in his effort for presentation excellence. If you want to become a KTG and be respectfully perceived as one, your work needs to always be at the highest possible level. <\/p> <p> And here are some other just as important reasons. <\/p> <p> Because you admire great presenters that never limit their efforts to improve and deliver a stunning presentation and you want to be like them. They never fail to prepare and practice as much as they can afford. And so should you. <\/p> <p> Because KTGs care about their audience and their own work. They create excellent presentations out of respect for both the people they are addressing and their work. <\/p> <p> Because you should look at your work as a piece of art that deserves the highest form of dedication. Your work, no matter the end product, is a representation of your qualities as a person, not just a professional in a certain field. <\/p>  <blockquote>You should look at your work as a piece of art that deserves the highest form of dedication<\/blockquote>  <p> Because you owe it to the act of knowledge transfer. Whether you are informing, teaching, or entertaining you should be conscious of the fact that you are delivering a form of knowledge. If you do it right you are contributing to human progress. If not - you are disrespecting other KTGs who try their hardest to be excellent at their work. <\/p> <p> Because a KTG has a responsibility to encourage and stimulate human interest. People need inspiration from new ideas and work presented to them. Then, in turn, they can start creating marvelous work and create interesting things. A bad presentation (here I include any form of knowledge transfer) can harm a person’s interest in a particular subject. A teacher that sucks at teaching will never inspire his students and stimulate their interest in his work and field. In fact, he will probably turn his apprentices against the subject and limit their desire to learn. This is contrary to progress and a KTG will never afford himself to act in such a way. <\/p>  <blockquote>A KTG has a responsibility to encourage and stimulate human interest<\/blockquote> <p> Because KTGs are idealists and perfectionists. They are true believers in putting extra effort and push the limits of creativity and what is possible. They will never shy away from rehearsing their presentations as many times as their schedules allow. They will think of ways to improve their presentations until the last possible moment, seconds before they take the stage. They will be the last to leave the room, so they can hear everyone who wanted to share thoughts, ideas and feedback. <\/p> <p> <a id=\"upe\">Delivering the ultimate presentation experience<\/a> <\/p> <em>“Leave your ego at the door - it’s all about your audience!”<\/em> <p> As a student of communication sciences, I have been at both the giving and the receiving end of a lecture. Thus, from my unique vantage point I was able to learn quite a few things about what is really going on behind the often simple and sometimes downright crude facade of a lecture. Let me briefly share what I have learned during those years of observation and practice. <\/p> <p> The one thing that really stood out was not just the amount of lectures for which the word “ultimate” would be the last in my vocabulary to spring into mind, but also how easy it was for me to lay criticism on them. This, despite my then apparent lack of expertise. The failures seemed plain obvious to me. It just didn’t take a genius to figure out the vast shortcomings of modern lectures. There might be many reasons for such shortcomings but let’s not waste our time making excuses. Let me finely illustrate my point with a story from my time in college. No antagonization of audience or lecturer is intended. <\/p> <p> Audience Perspective. <\/p> <p> There are times when the lecturer arrives late, losing precious time starting up the presentation software. The audience already starts to lose patience and attention. Eventually, the lecture starts and the people in the room (those who are not already fading away in daydreaming) in silent anticipation turn their eyes to the lecturer. What follows most probably sounds familiar: slides, consisting of seemingly infinite amount of text (I always get this desire at the end of the presentation, just before the Q&amp;A session, to thank the lecturer for reading to us), flicker from slide to slide. One after the other, they leave the impression that someone just used a copy of the original book or article, magnified it, and spread it on the wall for everybody in the room to read. As if the lecturer wants to divert all the attention to the wall and make himself unnoticeable. The end result, of course, is an exercise of boredom and a waste of time. The audience remembered almost nothing about what was presented and even worse - lost interest in the subject. <\/p> <p> Lecturer Perspective. <\/p> <p> Now, from the point of view of that poor lecturer it might be a whole lotta different story. He arrives late and this already spells trouble. Additional pressure is rarely of use, and he knows this. He enters, greeting everyone and switches on the presentation equipment. And then something goes wrong with the computer and he cannot start the projector. Things do not seem to be going the right way. More pressure builds up. He can notice the audience losing focus. Thoughts about how he could have done things differently start to emerge in this stressed mind of his. After some tweaking of the equipment and help from the maintenance staff, he can finally start. In just a few minutes the realisation that the lecture is over before it even began appears. Blank stares everywhere. <\/p> <p> In such moments he thinks that even if he suddenly starts talking about the pink panther Pinko, no one would notice or care. <\/p> <p> Perhaps, the lecturer could have chosen a more interesting topic to present. Or, maybe he should have spent some more time preparing and designing the presentation. He does not plan to ask for feedback and get an evaluation of his work from the audience: “it’s of no use”, he says to himself. Having all these thoughts is just more than a nuisance and it starts to take its toll on his attention. “Just five more minutes and it’s over” - thinking that it’s just a question of time. This mutual torture will end soon and he can get on with his life, no harm done. <\/p> <p> But the lecturer knows that this will not be exactly the case. It is also “just a question of time” before that next lecture and presentation is scheduled. <\/p> <p> Once I was a witness to the professor climbing on the table to try to start the beamer which was just below the ceiling, with everyone waiting. The saying that nobody pays attention to what shoes you wear has never been more wrong. <\/p> <p> Such scenarios are more often the case than not. Whether the setting is the big lecture hall, the small classroom, a conference or a big meeting room, the amount of fascination, inspiration and important ideas and information being dumbed down is more than unfortunate. It is appalling. <\/p> <p> However, there are also those rare and remarkable presentations which are so powerful that they change minds. Those presentations are carefully prepared, beautifully designed, and energetically delivered by remarkable communicators who possess an incredible power to inspire their audiences to change, learn, and explore. <\/p> <p> In this book we combine our knowledge and skills about presentations and teaching with the best methods observed and practiced by the true greats of lecturing. The final product is a practical guide that will help you prepare, design, deliver and evaluate your work to achieve what we define as “the ultimate presentation experience”. <\/p> <p> We begin with advice on how to prepare - lay the foundations for success before beginning the actual work. Next, we will look into ways in which you can best design your content, so it is both compelling and minimalist (stripped of all unnecessary distractions and aesthetically pleasing). Then, we will discuss what steps you need to take to ensure that when the moment comes, you will deliver a product capable of resonating with your audience. The last chapter is about evaluation, feedback and the gift of constructive criticism - all elements of paramount importance that combined with your uniqueness will help you develop your own presentation style. <\/p>"
}